{
  "common": {
    "name": "lovelace",
    "version": "4.0.0",
    "news": {
      "4.0.0": {
        "en": "Breaking: Update frontent to 2023.12.08.1\nBreaking: all states default to string now. Added some exceptions (like timestamps). Check your filters.\nUse better random numbers for tokens.\nSupport media_play_pause (mini-media-player card play / pause) again.\nSupport for input_select\nImprove support for sensor with device_class=date\nRemove hideToolbar from settings. Now using browser_mod to allow per instance control.\nrepaired persistent notifications.\nUse browser_mod to hide sidebar.",
        "de": "Breaking: Update-Front auf 2023.12.08.1\nBreaking: Alle Zustände (entity.state) sind standardmäßig Strings, jetzt. Einige Ausnahmen (wie Zeitstempel) hinzugefügt. Überprüft eure Filter.\nBessere Zufallszahlen für Tokens.\nSupport media_play_pause (mini-Media-Player-Karte geht wieder)\nUnterstützung für input_select\nUnterstützung für Sensor mit device_class=date\nhideToolbar aus Einstellungen entfernt. Nutze browser_mod, um per Instanz-Steuerung zu erlauben.\nReparatur von persistenten benachrichtigungen.\nVerwende browser_mod, um sidebar zu verstecken.",
        "ru": "Перерыв: обновление фронтанта до 2023.12.08.1\nПерерыв: все государства по умолчанию для строки сейчас. Добавлены некоторые исключения (например, метки). Проверьте свои фильтры.\nИспользуйте лучшие случайные числа для токенов.\nПоддержка media_play_pause (мини-медийная игра / пауза) снова.\nПоддержка enter_select\nУлучшение поддержки датчика с device_class=date\nУдалить скрыть Toolbar от настроек. Теперь, используя браузер_моду, чтобы позволить в примере управления.\nотремонтированные постоянные уведомления.\nИспользуйте браузер_mod, чтобы скрыть sidebar.",
        "pt": "Quebrando: Atualizar frontent para 2023.12.08.1\nQuebrando: todos os estados padrão para string agora. Adicionado algumas exceções (como timestamps). Verifique os filtros.\nUse melhores números aleatórios para tokens.\nSuporte media_play_pause (mini-media-player card play / pausa) novamente.\nSuporte para input_select\nMelhore o suporte para o sensor com device_class=date\nRemover esconder Barra de ferramentas de configurações. Agora, usando o browser_mod para permitir o controle por instância.\nnotificações persistentes reparadas.\nUse o browser_mod para esconder a barra lateral.",
        "nl": "Vertaling:\nInbraak: alle staten vallen nu aan string. Voegde wat uitzonderingen toe. Controleer je filters.\nGebruik meer willekeurige nummers voor tekenen.\nSteun mediaplay (mini-media-speler kaart / pauze) opnieuw.\nSteun voor inputselect\nImprove ondersteuning voor sensor met apparaat =-date\nVerstop je. Toolbar van settings. Met behulp van browsermod om per instance controle toe te staan.\nherstelt vervolgberichten.\nGebruik browsermod om een zijbar te verbergen.",
        "fr": "Breaking: Update frontent to 2023.12.08.1\nBreaking: tous les états par défaut à la chaîne maintenant. Ajout de quelques exceptions (comme les timetamps). Vérifiez vos filtres.\nUtilisez de meilleurs nombres aléatoires pour les jetons.\nSupport media_play_pause (mini-media-player card play / pause) à nouveau.\nSupport pour input_select\nAméliorez le support du capteur avec device_class=date\nRetirer le cachet Barre d'outils à partir de paramètres. Maintenant en utilisant browser_mod pour permettre le contrôle par instance.\nles notifications persistantes réparées.\nUtilisez browser_mod pour cacher la barre latérale.",
        "it": "Ripartizione: Aggiornamento frontale a 2023.12.08.1\nBreaking: tutti gli stati di default per stringa ora. Aggiunta alcune eccezioni (come timestamp). Controlla i filtri.\nUtilizzare numeri casuali migliori per i gettoni.\nSupport media_play_pause (mini-media-player card play / pausa) di nuovo.\nSupporto per input_select\nMigliora il supporto per il sensore con device_class=date\nRimuovi il nascondiglio Barra degli strumenti dalle impostazioni. Ora utilizzando browser_mod per consentire per controllo delle istanze.\nnotifiche persistenti riparate.\nUtilizzare browser_mod per nascondere la barra laterale.",
        "es": "Breaking: Actualizar frontent a 2023.12.08.1\nBreaking: todos los estados por defecto a cadena ahora. Agregó algunas excepciones (como los horarios). Revisa tus filtros.\nUse mejores números aleatorios para fichas.\nSoporte media_play_pause (mini-media-player card play / pause) de nuevo.\nSupport for input_select\nMejorar el soporte para sensor con device_class=date\nRetírese. Barra de herramientas desde la configuración. Ahora el uso de browser_mod para permitir el control por instancia.\nreparado de notificaciones persistentes.\nUse browser_mod para ocultar barra lateral.",
        "pl": "Przełom: Przedstawienie do 2023.12.08.1\nZłamanie: wszystkie stany domyślają się do strun. Wyróżnia się kilka wyjątków (np. znaczki czasowe). Wszystko filtruje.\nUżycie lepszych liczb losowych dla tokenów.\nMedia_pause (mini-media-player card play / pause) (ang.).\nWsparcie dla indeksu\nPoprawione wsparcie dla czujnika z urządzenie_class=date\nPrzewidywać się Toolbar from the settings (ang.). Zastosowanie przeglądarki_mod pozwala na kontrolę instancji.\nzremasterowane aktualizacje.\nUżycie przeglądarki_mod do ukrycia bocznego.",
        "uk": "Перерва: Оновлення переднього до 2023.12.08.1\nПерерва: всі стани за замовчуванням, щоб рядок зараз. Додайте деякі винятки (наприклад, мітки часу). Перевірити фільтри.\nВикористовуйте кращі випадкові номери для жетонів.\nПідтримка медіа_play_pause (міні-медійно-плеєрна картка / пауза) знову.\nПідтримка вхідних_select\nПокращення підтримки датчика з пристроєм_class=date\nВидалити приховати Клапан інструментів з налаштувань. Тепер за допомогою браузера_mod для керування екземпляром.\nвідремонтовані постійні повідомлення.\nВикористовуйте браузер_mod для приховувати бічні панелі.",
        "zh-cn": "处理:最新战线到2023.12.08.1\n打破:所有国家现在都拖欠会费。 增加一些例外(与时间限制)。 检查你的过滤。.\n使用较随机的数字。.\n支助媒体:互动_pause(媒体角色卡)再次发挥/作用。.\n投入支助\nA. 改善对传感器的支助\n移离掩护 2. 不受环境伤害。 现在使用“代行”来控制。.\n修理了持续通知。.\n使用缩写:为掩护。."
      },
      "3.0.1": {
        "en": "do not crash if no history instance selected.\nnotifications working again.\nrepaired color temperature handling.",
        "de": "nicht abstürzen, wenn keine History-Instanz ausgewählt wird.\nBenachrichtigungen funktionieren wieder.\nReparatur der Farbtemperatursteuerung.",
        "ru": "не мешайте, если не выбрана пример истории.\nуведомления, которые снова работают.\nотремонтированная обработка цветовой температуры.",
        "pt": "não travar se nenhuma instância do histórico selecionada.\nnotificações trabalhando novamente.\ntratamento de temperatura de cor reparado.",
        "nl": "niet crashen als geen geschiedenis instance geselecteerd is.\nde berichten werken weer.\ngerepareerde kleurtemperatuur.",
        "fr": "ne pas s'écraser si aucune instance historique n'est sélectionnée.\nles notifications fonctionnent à nouveau.\nla manipulation de la température de couleur réparée.",
        "it": "non crash se non viene selezionato un'istanza di storia.\nnotifiche che funzionano di nuovo.\ngestione della temperatura del colore riparato.",
        "es": "no se estrellen si no se selecciona ningún caso histórico.\nnotificaciones que funcionan de nuevo.\nmanejo de temperatura de color reparado.",
        "pl": "nie dochodzi do skutku, jeśli nie zostanie wybrana historia.\nponowne wyniki pracują ponownie.\nremontowany kolorową temperaturę.",
        "uk": "не вдається, якщо вибрано екземпляр історії.\nповідомлення про роботу знову.\nобробка кольорової температури.",
        "zh-cn": "如果没有选择过历史的事例,就不会发生事故。.\n再次发出通知。.\n修理的气温处理。."
      },
      "3.0.0": {
        "en": "added: per instance language support\nchanged: updated frontend to 20221027.0. Needs theme adjustment (add code-editor-background-color) and probably card updates\nadded: browser_mod (2.1.3) is now integrated. Please remove manual installed versions of custom browser_mod card.\nadded: 'instances.refresh' can be used to reload page in connected browsers.\nremoved: lovelace_reload and window_reload states\nremoved: name state, not supported by browser_mod anymore\nadded: Support for toasts with action button (either json or ;-string)\nadded: activity state will show if user is currently using a certain browser\nadded: Support for subfolders in /cards/ for images and stuff custom cards load (please keep cards in root folder).",
        "de": "hinzugefügt: per Instanz sprachunterstützung\ngeändert: aktualisiertes Frontend auf 20221027.0 Benötigt Thema Anpassung (z.B. neu code-editor-background-color) und wahrscheinlich Karten-Updates\nadd: browser_mod (2.1.3) ist jetzt integriert. Bitte entfernen Sie manuell installierte Versionen der browser_mod-Karte.\nhinzugefügt: instances.refresh kann verwendet werden, um die Seite in verbundenen Browsern neu zu laden.\nentfernt: lovelace_reload und windows_reload\nentfernt: name-State, nicht mehr von browser_mod unterstützt\nadded: Unterstützung für Toasts mit Aktionsknopf (entweder json oder -;string)\nadded: Aktivitätszustand, der anzeigt, ob der Nutzer derzeit einen bestimmten Browser bedient\nadded: Unterstützung für Unterordner in /cards/ für Bilder und Materialien benutzerdefinierte Karten (bitte die Karten selber im Wurzelordner lassen).",
        "ru": "добавлено: в пример языковой поддержки\nизменено: обновление frontend до 20221027.0 Нужна настройка темы (add code-editor-background-color) и, вероятно, обновления карты\nдобавлено: browser_mod (2.1.3) теперь интегрирован. Пожалуйста, удалите вручную установленные версии пользовательского браузера_mod карты.\nдобавлено: instances.refresh можно использовать для перезагрузки страницы в подключенных браузерах.\nудалено: lovelace_reload and window_reload состояния\nудалено: имя состояние, не поддерживается браузером_mod более\nдобавлено: Поддержка тостов с кнопкой действия (либо json или -;string)\nдобавлено: состояние активности покажет, если пользователь в настоящее время использует определенный браузер\nдобавлено: Поддержка субпастеров в картах для загрузки изображений и настраиваемых карт (пожалуйста, держите карты в папке root).",
        "pt": "adicionado: por exemplo suporte de idioma\nalterado: frontend atualizado para 20221027.0 Precisa de ajuste de tema (add code-editor-background-color) e, provavelmente, atualizações de cartão\nadicionado: browser_mod (2.1.3) agora está integrado. Por favor, remova as versões manuais instaladas do cartão browser_mod personalizado.\nadicionado: instances.refresh a atualização pode ser usada para recarregar a página em navegadores conectados.\nremovido: lovelace_reload and window_reload states\nremovido: name state, não suportado pelo browser_mod mais\nadicionado: Suporte para torradas com botão de ação (quer json ou -;string)\nadicionado: estado de atividade irá mostrar se o usuário está usando um determinado navegador\nadicionado: Suporte para subpastas em cartões para imagens e coisas cartões personalizados de carga (por favor, mantenha cartões na pasta raiz).",
        "nl": "vertaling:\nverandering: Heeft thema aanpassing nodig (add code-aditor-background-color) en waarschijnlijk kaart updates\ntoegevoegd: browsermod (2.1.3) is nu geïntegreerd. Verwijder handmatig geïnstalleerde versies van de gewone browsermod kaart.\ntoegevoegd: instances.refresh kan gebruikt worden om pagina te herladen in verbonden browsers.\n_\nverwijdert: naam staat, niet ondersteund door browsermod\nversterking voor toasts met actieknop\nde activiteitsstaat laat zien of gebruiker momenteel een bepaalde browser gebruikt\nsteun voor subfolders in kaarten voor foto's en klantenkaarten laden in wortelvouder.",
        "fr": "ajouté: par exemple le soutien linguistique\nchangé: mise à jour du frontend à 20221027.0 Besoins réglage de thème (add code-editor-background-color) et probablement mises à jour de carte\najouté: browser_mod (2.1.3) est maintenant intégré. Veuillez supprimer les versions manuelles installées de la carte personnalisée browser_mod.\najouté: instances. rafraîchissement peut être utilisé pour recharger la page dans les navigateurs connectés.\nsupprimé: lovelace_reload et windows_reload états\nenlevé: état de nom, non pris en charge par browser_mod plus\najouté: Support pour les toasts avec bouton d'action (soit json ou -;string)\najouté: état d'activité montrera si l'utilisateur utilise actuellement un certain navigateur\najouté: Support pour les sous-dossiers dans les cartes pour les images et la charge de cartes personnalisées (veuillez garder les cartes dans le dossier racine).",
        "it": "aggiunto: per esempio supporto linguistico\nmodificato: frontend aggiornato a 20221027.0 Ha bisogno di regolazione del tema (add code-editor-background-color) e probabilmente aggiornamenti della carta\naggiunto: browser_mod (2.1.3) è ora integrato. Si prega di rimuovere le versioni di browser_mod personalizzato.\naggiunto: instances.refresh può essere utilizzato per ricaricare la pagina nei browser collegati.\nrimosso: lovelace_reload e window_reload stati\nrimosso: nome stato, non supportato da browser_mod più\naggiunto: Supporto per toast con pulsante d'azione (sia json che -;string)\naggiunto: lo stato di attività mostrerà se l'utente sta attualmente utilizzando un certo browser\naggiunto: Supporto per le sottocartelle nelle schede per immagini e roba carico di carte personalizzate (mantenere le carte nella cartella principale).",
        "es": "añadido: por ejemplo apoyo al idioma\ncambiado: actualización de frontend a 20221027.0 Necesidades de ajuste de tema (add code-editor-background-color) y probablemente actualizaciones de tarjetas\nañadido: browser_mod (2.1.3) está ahora integrado. Por favor, retire las versiones instaladas manualmente de la tarjeta browser_mod personalizada.\nañadido: instances.refresh se puede utilizar para recargar página en los navegadores conectados.\neliminados: estados lovelace_reload y window_reload\neliminado: estado de nombre, no soportado por browser_mod más\nañadido: Soporte para tostadas con botón de acción (ya sea json o -;string)\nañadido: estado de actividad mostrará si el usuario está utilizando un determinado navegador\nañadido: Soporte para subcarpetas en tarjetas para la carga de imágenes y material de tarjetas personalizadas (por favor, mantenga las tarjetas en la carpeta raíz).",
        "pl": "upoważnianie języka\nzmieniło się: zaktualizowano front do 20221027. Konstrukcja tematu (dodawanie kod-editor-ground-color) oraz prawdopodobnie aktualizacja kart\ndodano: przeglądarkę_mod (2.1.3). Zastosowanie ręcznych wersji karty przeglądarki_mod.\ndostęp: instances.refresh być używany do przeładowania strony w połączonych przeglądarkach.\nusunięte: miłość_reload and window_reload\nusunięta: nazwa nie jest wspierana przez przeglądarkę_mod anymore\ndodał: Wspieranie toastów z przyciskiem (json lub -;string)\ndodano: stan aktywności pokazuje, że użytkownik jest obecnie używany przez określoną przeglądarkę\ndodał: Wsparcie dla subklerów w kartach dla obrazów i kart przechowywania kart (please keep cards in root folder).",
        "uk": "додано: підтримка мови екземпляра\nзмінено: оновлений фронтенд до 20221027.0 Потрібні налаштування теми (add code-editor-phone-color) і, ймовірно, оновлення карт\nдодано: браузер_mod (2.1.3) тепер інтегрований. Будь ласка, видаліть ручні встановлені версії користувацького браузера_mod карти.\nдодано: instances.refresh перезавантажити сторінку в підключених браузерах.\nвидалити: lovelace_reload і windows_reload стани\nвидалити: стан імен, не підтримується браузером_mod додатково\nдоданий: Підтримка тастів з кнопкою дії (або json або -;string)\nдодано: стан роботи покаже, якщо користувач наразі використовує певний браузер\nдодано: Підтримка підпапок у картках для зображень та начинок на замовлення, завантаження карт (збережіть картки у папці кореневих).",
        "zh-cn": "增加:每一类语文支助\n修改:更新前线到20221027.0。 需求专题调整(附加编码的外地领地)以及可能提供最新资料\n增加:现正在综合编(2.1.3)。 请取消制造的习俗包件的手册。.\n增加:情况。 可以用来复制连带代的页。.\n删除:亲王:重载和窗口。\n删除:姓名国,未获括号内的支持;莫斯·马约尔\n增加:支持以行动、但顿(既不是 json,也不是;示范)\n增加:如果用户目前使用某些代行,活动国将显示活动情况。\n增加:支持在图像和制成品的卡里的投影器(装有根带的卡)。."
      },
      "2.2.0": {
        "en": "fixed: incorrect warning about duplicate entities on update of manual entity.\nfixed: input_datetime did not work if time was enabled and did vanish if date and time were enabled.\nfixed: RGB hex string got broken on not rounded numbers (problem with mushroom ligth card).\nfixed: state of cover entity if not 0 or 100% (fixes problem with sliter-button-card).\nfixed: light did not read brightness ACTUAL in dimmer devices.\nadded: support auto entities card and subscription.\nadded: improve support for input_datetime & string states.\nadded: support for browser_mod (i.e. crontrol frontend from iobroker).",
        "de": "behoben: Falsche Warnung vor doppelten Entitäten beim Update einer manuellen Entität.\nbehoben: input_datetime funktionierte nicht, wenn die Uhrzeit aktiviert war, und verschwand, wenn Datum und Uhrzeit aktiviert waren.\nbehoben: RGB-Hex-String wurde bei nicht gerundeten Zahlen unterbrochen (Problem mit Pilzlichtkarte).\nbehoben: Zustand der Abdeckungsentität, wenn nicht 0 oder 100% (behebt das Problem mit der Sliter-Button-Karte).\nbehoben: Licht hat Helligkeit IST bei Dimmergeräten nicht gelesen.\nhinzugefügt: Unterstützung von Karten und Abonnements für automatische Entitäten.\nhinzugefügt: verbesserte Unterstützung für input_datetime & String-Zustände.\nhinzugefügt: Unterstützung für browser_mod (d. h. Crontrol-Frontend von iobroker).",
        "ru": "исправлено: некорректное предупреждение о повторяющихся сущностях при обновлении ручной сущности.\nисправлено: input_datetime не работал, если время было включено, и исчезало, если были включены дата и время.\nисправлено: шестнадцатеричная строка RGB ломалась на неокругленных числах (проблема с грибовидной картой).\nисправлено: состояние объекта покрытия, если не 0 или 100% (исправляет проблему с картой-кнопкой).\nисправлено: свет не считывал АКТУАЛЬНУЮ яркость в диммерных устройствах.\nдобавлено: поддержка автоматических карточек и подписок.\nдобавлено: улучшена поддержка input_datetime и строковых состояний.\nдобавлено: поддержка browser_mod (т.е. интерфейс crontrol от iobroker).",
        "pt": "corrigido: aviso incorreto sobre entidades duplicadas na atualização da entidade manual.\nfixo: input_datetime não funcionava se a hora estivesse habilitada e desaparecia se data e hora estivessem habilitadas.\ncorrigido: a string hexadecimal RGB foi quebrada em números não arredondados (problema com o cartão de luz de cogumelo).\nfixo: estado da entidade de cobertura se não for 0 ou 100% (corrige o problema com o cartão-botão cortador).\nfixo: a luz não lia o brilho REAL em dispositivos dimmer.\nadicionado: suporte a cartão e assinatura de entidades automáticas.\nadicionado: melhore o suporte para estados input_datetime e string.\nadicionado: suporte para browser_mod (ou seja, frontend crontrol do iobroker).",
        "nl": "opgelost: onjuiste waarschuwing over dubbele entiteiten bij update van handmatige entiteit.\nopgelost: input_datetime werkte niet als tijd was ingeschakeld en verdween als datum en tijd waren ingeschakeld.\nopgelost: RGB hex string is gebroken op niet afgeronde getallen (probleem met paddenstoellichtkaart).\nvast: staat van dekkingsentiteit indien niet 0 of 100% (probleem met sliter-knop-kaart opgelost).\nvast: het licht leest de helderheid niet ACTUAL in dimmers.\ntoegevoegd: ondersteuning voor auto-entiteitenkaart en abonnement.\ntoegevoegd: ondersteuning voor input_datetime & string-statussen verbeteren.\ntoegevoegd: ondersteuning voor browser_mod (d.w.z. crontrol frontend van iobroker).",
        "fr": "corrigé : avertissement incorrect concernant les entités en double lors de la mise à jour de l'entité manuelle.\ncorrigé : input_datetime ne fonctionnait pas si l'heure était activée et disparaissait si la date et l'heure étaient activées.\ncorrigé : la chaîne hexadécimale RVB était cassée sur des nombres non arrondis (problème avec la carte champignon).\ncorrigé : état de l'entité de couverture si ce n'est pas 0 ou 100 % (corrige le problème avec la découpeuse-bouton-carte).\ncorrigé : la lumière n'a pas lu la luminosité RÉELLE dans les dispositifs de gradation.\najouté : prise en charge de la carte et de l'abonnement des entités automatiques.\najouté : amélioration de la prise en charge des états input_datetime et string.\najouté : prise en charge de browser_mod (c'est-à-dire l'interface crontrol d'iobroker).",
        "it": "corretto: avviso errato su entità duplicate sull'aggiornamento dell'entità manuale.\nrisolto: input_datetime non funzionava se l'ora era abilitata e svaniva se la data e l'ora erano abilitate.\nrisolto: la stringa esadecimale RGB si interrompeva su numeri non arrotondati (problema con la scheda fungo ligth).\nfisso: stato dell'entità della copertura se diverso da 0 o 100% (risolve il problema con la tessera-tasto-sliter).\nfisso: la luce non ha letto la luminosità EFFETTIVA nei dispositivi dimmer.\naggiunto: supporto per la carta delle entità automatiche e l'abbonamento.\naggiunto: miglioramento del supporto per input_datetime e stati delle stringhe.\naggiunto: supporto per browser_mod (cioè frontend di crotrol da iobroker).",
        "es": "corregido: advertencia incorrecta sobre entidades duplicadas en la actualización de la entidad manual.\ncorregido: input_datetime no funcionaba si la hora estaba habilitada y desaparecía si la fecha y la hora estaban habilitadas.\nsolucionado: la cadena hexadecimal RGB se rompió en números no redondeados (problema con la tarjeta de luz de hongos).\narreglado: estado de la entidad de cobertura si no es 0 o 100% (soluciona el problema con la tarjeta de botón de corte).\ncorregido: la luz no leía el brillo REAL en los dispositivos de atenuación.\nagregado: admite tarjeta de entidades automáticas y suscripción.\nagregado: mejore el soporte para input_datetime y estados de cadena.\nagregado: soporte para browser_mod (es decir, frontend crontrol de iobroker).",
        "pl": "naprawiono: nieprawidłowe ostrzeżenie o zduplikowanych encjach przy aktualizacji encji ręcznej.\nnaprawiono: input_datetime nie działał, jeśli czas był włączony i znikał, jeśli data i godzina były włączone.\nnaprawiono: ciąg szesnastkowy RGB pękał na niezaokrąglonych liczbach (problem z kartą grzybkową).\nnaprawiono: stan jednostki okładki, jeśli nie 0 lub 100% (rozwiązuje problem z kartą z przyciskami sliterowymi).\nnaprawiono: światło nie odczytywało jasności AKTUALNEJ w urządzeniach ze ściemniaczem.\ndodano: obsługa karty i subskrypcji podmiotów automatycznych.\ndodano: poprawiono obsługę input_datetime i stanów stringów.\ndodano: wsparcie dla browser_mod (czyli crontrol frontend z iobroker).",
        "zh-cn": "修复：手动实体更新时有关重复实体的错误警告。\n已修复：如果启用了时间，则 input_datetime 不起作用，如果启用了日期和时间，则会消失。\n修复：RGB 十六进制字符串在非四舍五入的数字上被破坏（蘑菇灯卡问题）。\n已修复：如果不是 0 或 100%，则覆盖实体的状态（修复了 sliter-button-card 的问题）。\n已修复：调光器设备中的灯光未读取实际亮度。\n补充：支持自动实体卡和订阅。\n添加：改进对 input_datetime 和字符串状态的支持。\n添加：对 browser_mod 的支持（即来自 iobroker 的 crontrol 前端）。",
        "uk": "виправлено: некоректне попередження про дублікати сутностей під час оновлення ручної сутності.\nвиправлено: input_datetime не працював, якщо час було ввімкнено, і зникав, якщо дата й час були ввімкнені.\nвиправлено: шістнадцятковий рядок RGB порушувався на незаокруглених числах (проблема з грибоподібною карткою).\nвиправлено: стан об’єкта покриття, якщо не 0 або 100% (вирішено проблему з картою кнопки-розрізу).\nвиправлено: світло не зчитує АКТУАЛЬНУ яскравість у димерах.\nдодано: підтримка автоматичної картки та підписки.\nдодано: покращено підтримку станів input_datetime та рядків.\nдодано: підтримка browser_mod (тобто інтерфейс crontrol від iobroker)."
      },
      "2.1.4": {
        "en": "Dependency update",
        "de": "Abhängigkeits-Update",
        "ru": "Обновление зависимости",
        "pt": "Atualização de dependência",
        "nl": "Afhankelijkheidsupdate",
        "fr": "Mise à jour des dépendances",
        "it": "Aggiornamento delle dipendenze",
        "es": "Actualización de dependencia",
        "pl": "Aktualizacja zależności",
        "zh-cn": "依赖更新",
        "uk": "Оновлення залежності"
      },
      "2.1.3": {
        "en": "Fixed: remove backup of old frontend (sorry)",
        "de": "Behoben: Backup des alten Frontends entfernen (sorry)",
        "ru": "Исправлено: удалить резервную копию старого интерфейса (извините)",
        "pt": "Corrigido: remover backup de front-end antigo (desculpe)",
        "nl": "Opgelost: verwijder back-up van oude frontend (sorry)",
        "fr": "Corrigé : supprimer la sauvegarde de l'ancienne interface (désolé)",
        "it": "Risolto: rimuovere il backup del vecchio frontend (scusate)",
        "es": "Corregido: eliminar la copia de seguridad de la interfaz anterior (lo siento)",
        "pl": "Naprawiono: usuń kopię zapasową starego frontendu (przepraszam)",
        "zh-cn": "修正：删除旧前端的备份（抱歉）",
        "uk": "Виправлено: видалення резервної копії старого інтерфейсу (вибачте)"
      },
      "2.1.2": {
        "en": "Fixed: Menu was broken in frontend.",
        "de": "Behoben: Menü war im Frontend defekt.",
        "ru": "Исправлено: меню было сломано во внешнем интерфейсе.",
        "pt": "Corrigido: o menu estava quebrado no frontend.",
        "nl": "Opgelost: menu was gebroken in frontend.",
        "fr": "Corrigé : le menu était cassé dans le frontend.",
        "it": "Risolto: il menu era rotto nel frontend.",
        "es": "Corregido: el menú estaba roto en la interfaz.",
        "pl": "Naprawiono: Menu było zepsute we frontendzie.",
        "zh-cn": "修正：菜单在前端坏了。",
        "uk": "Виправлено: меню було зламано у інтерфейсі."
      }
    },
    "title": "Visualization with Lovelace-UI",
    "titleLang": {
      "en": "Visualization with Lovelace-UI",
      "de": "Visualisierung mit Lovelace-UI",
      "ru": "Визуализация с помощью Lovelace-UI",
      "pt": "Visualização com Lovelace-UI",
      "nl": "Visualisatie met Lovelace-UI",
      "fr": "Visualisation avec Lovelace-UI",
      "it": "Visualizzazione con Lovelace-UI",
      "es": "Visualización con Lovelace-UI",
      "pl": "Wizualizacja za pomocą Lovelace-UI",
      "zh-cn": "使用Lovelace-UI进行可视化",
      "uk": "Візуалізація за допомогою Lovelace-UI"
    },
    "desc": {
      "en": "With this adapter you can build visualization for ioBroker with Home Assistant Lovelace UI",
      "de": "Mit diesem Adapter können Sie eine Visualisierung für ioBroker mit der Home Assistant Lovelace-Benutzeroberfläche erstellen",
      "ru": "С помощью этого адаптера вы можете создавать визуализацию для ioBroker с Home Assistant Lovelace UI",
      "pt": "Com este adaptador você pode construir visualização para o ioBroker com o Home Assistant Lovelace UI",
      "nl": "Met deze adapter kunt u visualisatie bouwen voor ioBroker met Home Assistant Lovelace UI",
      "fr": "Avec cet adaptateur, vous pouvez créer une visualisation pour ioBroker avec Home Assistant Lovelace UI",
      "it": "Con questo adattatore puoi costruire la visualizzazione per ioBroker con l'interfaccia utente di Home Assistant Lovelace",
      "es": "Con este adaptador puede crear visualización para ioBroker con Home Assistant Lovelace UI",
      "pl": "Za pomocą tego adaptera możesz zbudować wizualizację dla ioBroker z interfejsem Home Assistant Lovelace",
      "zh-cn": "使用此适配器，您可以使用Home Assistant Lovelace UI为ioBroker构建可视化",
      "uk": "За допомогою цього адаптера ви можете створити візуалізацію для ioBroker з інтерфейсом користувача Home Assistant Lovelace"
    },
    "authors": [
      "bluefox <dogafox@gmail.com>"
    ],
    "keywords": [
      "ioBroker",
      "template",
      "Smart Home",
      "home automation"
    ],
    "license": "Apache-2.0",
    "platform": "Javascript/Node.js",
    "tier": 3,
    "icon": "lovelace.png",
    "main": "main.js",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.lovelace/master/admin/lovelace.png",
    "readme": "https://github.com/ioBroker/ioBroker.lovelace/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "visualization",
    "compact": true,
    "materialize": true,
    "supportCustoms": true,
    "messagebox": true,
    "connectionType": "local",
    "dataSource": "push",
    "localLink": "%protocol%://%ip%:%port%/",
    "welcomeScreen1": {
      "link": "",
      "name": "Lovelace",
      "img": "lovelace/icons/favicon-192x192.png",
      "color": "#03a9f4",
      "order": 2,
      "localLink": true
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<=2.0.0",
            "newVersion>=3.0.0"
          ]
        },
        "title": {
          "en": "Visualisation Update",
          "de": "Aktualisierung der Visualisierung",
          "ru": "Обновление визуализации",
          "pt": "Atualização da visualização",
          "nl": "Visualisatie Update",
          "fr": "Mise à jour de la visualisation",
          "it": "Aggiornamento della visualizzazione",
          "es": "Actualización de Visualización",
          "pl": "Visualizacja",
          "uk": "Оновлення візуалізації",
          "zh-cn": "更新"
        },
        "text": {
          "en": "The update to version 3.x will change frontend version from 20211229.0 to 20221026.0. This means 10 months development of Lovelace in one update. You will probably need to update or fix your themes and custom cards. Please make sure to check your visualization after this update. Ask in forum or discord for help.",
          "de": "Das Update auf Version 3.x wird die Frontend Version von 20211229.0 auf 20221026.0 ändern. Dies bedeutet 10 Monate Entwicklung von Lovelace in einem Update. Sie müssen wahrscheinlich Ihre Themen und benutzerdefinierten Karten aktualisieren oder reparieren. Achten Sie darauf, Ihre Visualisierung nach diesem Update zu überprüfen. Fragen Sie im Forum oder Discord nach Hilfe.",
          "ru": "Обновление до версии 3.x изменит версию frontend от 20211229.0 до 20221026.0 Это означает 10 месяцев разработки Lovelace в одном обновлении. Вам, вероятно, нужно обновить или исправить ваши темы и пользовательские карты. Пожалуйста, проверьте вашу визуализацию после этого обновления. Спросите на форуме или несогласно помощи.",
          "pt": "A atualização para a versão 3.x mudará a versão do frontend de 20211229.0 para 20221026.0 Isso significa desenvolvimento de 10 meses do Lovelace em uma atualização. Você provavelmente precisará atualizar ou corrigir seus temas e cartões personalizados. Certifique-se de verificar sua visualização após esta atualização. Pergunte no fórum ou Discord para ajuda.",
          "nl": "De update van versie 3.x zal de frontend versie veranderen van 20211229.0 tot 202226. Dit betekent 10 maanden ontwikkeling van Lovelace in één update. Je moet waarschijnlijk updaten of je thema's en kaarten repareren. Controleer uw visualisatie na deze update. Vraag in forum of Discord om hulp.",
          "fr": "La mise à jour de la version 3.x va changer la version frontend de 20211229.0 à 20221026.0 Cela signifie 10 mois de développement de Lovelace dans une mise à jour. Vous devrez probablement mettre à jour ou corriger vos thèmes et vos cartes personnalisées. Assurez-vous de vérifier votre visualisation après cette mise à jour. Demandez de l'aide au forum ou à la Discord.",
          "it": "L'aggiornamento alla versione 3.x cambierà la versione frontend da 20211229.0 a 20221026.0 Ciò significa 10 mesi di sviluppo di Lovelace in un unico aggiornamento. Probabilmente dovrai aggiornare o correggere i tuoi temi e le tue carte personalizzate. Assicurati di controllare la visualizzazione dopo questo aggiornamento. Chiedi aiuto in forum o Discord.",
          "es": "La actualización a la versión 3.x cambiará la versión de frontend de 20211229.0 a 20221026.0 Esto significa desarrollo de 10 meses de Lovelace en una actualización. Probablemente necesite actualizar o arreglar sus temas y tarjetas personalizadas. Asegúrese de comprobar su visualización después de esta actualización. Pida ayuda en el foro o Discord.",
          "pl": "Zaktualizowana wersja 3.x będzie zmieniała przednią wersję od 20211229.0 do 20221026.0. Oznacza to, że w jednym uaktualnianiu jest 10 miesięcy rozwój Lovelace. Prawdopodobnie potrzebuje uaktualnienia lub naprawienia swoich motywów i kart. Postanawia sprawdzić wizualizację po tej aktualizacji. Odpowiada za pomoc.",
          "uk": "Оновлення версії 3.x змінить версію фронтенду з 20211229.0 до 20221026.0 Це означає 10 місяців розробки Lovelace в одному оновленні. Ви, ймовірно, повинні оновити або виправити ваші теми і спеціальні картки. Будь ласка, перевірте вашу візуалізацію після цього оновлення. Запитайте на форум або розпишіться на допомогу.",
          "zh-cn": "更新后的3.x将改变20211229.0至20221026年的前沿版本。 这就意味着在更新的一年里发展了良机。 你很可能需要更新或确定你们的主题和习俗卡。 请确保在更新之后检查你的视觉。 论坛或有帮助的办事处。."
        },
        "link": "https://forum.iobroker.net/topic/34775/test-adapter-lovelace-v1-2-x/1324?_=1666881699892",
        "level": "warn",
        "linkText": {
          "en": "A few issues with themes were already discussed here.",
          "de": "Hier wurden bereits einige Themen diskutiert.",
          "ru": "Здесь уже обсуждались несколько вопросов с темами.",
          "pt": "Algumas questões com temas já foram discutidas aqui.",
          "nl": "Een paar problemen met ze werden hier al besproken.",
          "fr": "Quelques questions avec des thèmes ont déjà été discutées ici.",
          "it": "Sono già state discusse alcune questioni con temi.",
          "es": "Algunos temas con temas ya se discutieron aquí.",
          "pl": "Omawiano tam kilka tematów.",
          "uk": "Тут вже обговорювалися кілька питань з темами.",
          "zh-cn": "这里已经讨论了几个专题的问题。."
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ],
    "dependencies": [
      {
        "js-controller": ">=3.3.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "welcomeScreenPro": {
      "link": "lovelace/",
      "name": "Lovelace",
      "img": "lovelace.admin/lovelace.png",
      "color": "#03a9f4",
      "order": 6,
      "localLink": true
    }
  },
  "native": {
    "history": "",
    "historyMaxCount": 2000,
    "port": 8091,
    "auth": false,
    "secure": false,
    "bind": "0.0.0.0",
    "certPublic": "",
    "certPrivate": "",
    "certChained": "",
    "defaultUser": "admin",
    "onlyAllowWhenUserIsOwner": false,
    "ttl": 3600,
    "themes": "",
    "defaultTheme": "default",
    "defaultThemeDark": "default",
    "leEnabled": false,
    "leUpdate": false,
    "leCheckPort": 80,
    "aliayOnly": false,
    "blindsInvert": false,
    "alarmCheckCodeOnDisarmOnly": false,
    "language": "",
    "updateTimeout": 5000,
    "logbookSource": "adapter"
  },
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.entitiesUpdated",
      "type": "state",
      "common": {
        "name": "If the list of entities was updated",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "state",
        "def": false
      }
    },
    {
      "_id": "info.readyForClients",
      "type": "state",
      "common": {
        "name": "Lovelace is ready to interact with UI and ioBroker.",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "indicator.reachable",
        "def": false
      }
    },
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": "user files and images for lovelace",
        "type": "meta.user"
      },
      "native": {}
    },
    {
      "_id": "configuration",
      "type": "channel",
      "common": {
        "name": "Storage"
      },
      "native": {}
    },
    {
      "_id": "session",
      "type": "state",
      "common": {
        "name": "Oauth2 Session",
        "type": "json",
        "role": "state"
      },
      "native": {}
    },
    {
      "_id": "conversation",
      "type": "state",
      "common": {
        "name": "Question and answer for conversation ",
        "desc": "Question and answer for conversation dialog. See readme for how to use.",
        "desc1": {
          "en": "Question and answer for conversation dialog. See readme for how to use.",
          "de": "Frage und Antwort zum Gesprächsdialog. Informationen zur Verwendung finden Sie in der Readme-Datei.",
          "ru": "Вопрос и ответ для диалога. Смотрите readme для того, чтобы использовать.",
          "pt": "Perguntas e respostas para o diálogo de conversação. Consulte o leia-me para saber como usar.",
          "nl": "Vraag en antwoord voor gespreksdialoog. Zie leesmij voor gebruik.",
          "fr": "Question et réponse pour le dialogue de conversation. Voir le readme pour savoir comment l'utiliser.",
          "it": "Domanda e risposta per la finestra di dialogo di conversazione. Vedi il file Leggimi per come usare.",
          "es": "Preguntas y respuestas para el diálogo de conversación. Consulte el archivo Léame para saber cómo usarlo.",
          "pl": "Pytania i odpowiedzi do dialogu rozmowy. Zobacz, jak używać.",
          "zh-cn": "对话对话框的问答。有关使用方法，请参见自述文件。"
        },
        "type": "string",
        "role": "state"
      },
      "native": {}
    },
    {
      "_id": "control",
      "type": "channel",
      "common": {
        "name": "Control lovelace"
      },
      "native": {}
    },
    {
      "_id": "control.shopping_list",
      "type": "state",
      "common": {
        "name": "Shopping list as json",
        "type": "json",
        "write": true,
        "read": true,
        "desc": "Used for shopping list card"
      },
      "native": {}
    },
    {
      "_id": "control.alarm",
      "type": "state",
      "common": {
        "name": "alarm",
        "type": "boolean",
        "write": true,
        "read": true,
        "desc": "Arm or disarm with code",
        "def": false
      },
      "native": {
        "alarm_code": 1234
      }
    },
    {
      "_id": "control.alarm_arm_state",
      "type": "state",
      "common": {
        "name": "arm status",
        "type": "number",
        "write": true,
        "read": true,
        "desc": "Set/Read alarm arm status",
        "def": 0,
        "states": {
          "0": "disarmed",
          "1": "armed",
          "2": "armed_home",
          "3": "armed_away",
          "4": "armed_night",
          "5": "armed_custom_bypass",
          "6": "pending",
          "7": "arming",
          "8": "disarming",
          "9": "triggered",
          "10": "arm_vacation"
        }
      },
      "native": {
        "alarm_code": 1234
      }
    },
    {
      "_id": "control.theme",
      "type": "state",
      "common": {
        "name": "theme",
        "type": "string",
        "write": true,
        "read": true,
        "desc": "Change default theme during runtime",
        "states": {
          "default": "default"
        }
      }
    },
    {
      "_id": "control.themeDark",
      "type": "state",
      "common": {
        "name": "theme",
        "type": "string",
        "write": true,
        "read": true,
        "desc": "Change default dark theme during runtime",
        "states": {
          "default": "default"
        }
      }
    },
    {
      "_id": "control.darkMode",
      "type": "state",
      "common": {
        "name": "Dark Mode",
        "desc": "Allows to switch to dark/light mode without changing themes (some themes support both)",
        "write": true,
        "read": true,
        "def": false
      }
    },
    {
      "_id": "notifications",
      "type": "channel",
      "common": {
        "name": "notifications"
      },
      "native": {}
    },
    {
      "_id": "notifications.list",
      "type": "state",
      "common": {
        "name": "alarm",
        "type": "json",
        "write": true,
        "read": true,
        "desc": "List of notifications"
      },
      "native": {}
    },
    {
      "_id": "notifications.add",
      "type": "state",
      "common": {
        "name": "Add notification",
        "type": "string",
        "write": true,
        "read": false,
        "desc": "Add notification"
      },
      "native": {}
    },
    {
      "_id": "notifications.clear",
      "type": "state",
      "common": {
        "name": "Clear notification",
        "type": "number",
        "write": true,
        "read": false,
        "desc": "Clear notification by id or all if no id"
      },
      "native": {}
    }
  ]
}
