{
    "common": {
        "name": "lovelace",
        "version": "1.5.0",
        "news": {
            "1.5.0": {
                "en": "Changed: defaultTheme and control.theme were in conflict. Now control.theme is set when selecting a new default theme.\nAdded: control.themeDark to control devices in dark mode, too.\nFixed: Device Icons with authentication now work\nChanged: previously only admin user could change lovelace config. Now also the owner of the configuration object and members of the owner groupd are allowed to change UI.\nInternal code cleanup / breaking dependency update.\nAdded: Support for pure humidity sensors.\nAdded: Support for URL as entity_image\nFixed: Adjust user-name/user-id handlig to changes in js-controller\nFixed: default themes do not show as selected\nFixed: Loading themes / custom cards / image-proxy",
                "de": "Geändert: defaultTheme und control.theme standen in Konflikt. Jetzt wird control.theme festgelegt, wenn ein neues Standardthema ausgewählt wird.\nHinzugefügt: control.themeDark, um Geräte auch im Dunkelmodus zu steuern.\nBehoben: Gerätesymbole mit Authentifizierung funktionieren jetzt\nGeändert: Bisher konnte nur der Administrator die Lovelace-Konfiguration ändern. Jetzt dürfen auch der Eigentümer des Konfigurationsobjekts und die Mitglieder der Eigentümergruppe die Benutzeroberfläche ändern.\nInterne Codebereinigung / Aktualisierung der Abhängigkeitsunterbrechung.\nHinzugefügt: Unterstützung für reine Feuchtigkeitssensoren.\nHinzugefügt: Unterstützung für URL als entity_image\nBehoben: Passen Sie den Benutzernamen / die Benutzer-ID an Änderungen im js-controller an\nBehoben: Standardthemen werden nicht als ausgewählt angezeigt\nBehoben: Laden von Themes / benutzerdefinierten Karten / Image-Proxy",
                "ru": "Изменено: defaultTheme и control.theme конфликтовали. Теперь control.theme устанавливается при выборе новой темы по умолчанию.\nДобавлено: control.themeDark для управления устройствами в темном режиме.\nИсправлено: значки устройств с аутентификацией теперь работают.\nИзменено: ранее только администратор мог изменять конфигурацию lovelace. Теперь владелец объекта конфигурации и члены группы-владельца также могут изменять пользовательский интерфейс.\nОчистка внутреннего кода / обновление зависимостей.\nДобавлено: поддержка датчиков чистой влажности.\nДобавлено: поддержка URL как entity_image.\nИсправлено: корректировка имени пользователя / идентификатора пользователя для изменений в js-контроллере.\nИсправлено: темы по умолчанию не отображаются как выбранные.\nИсправлено: загрузка тем / пользовательских карточек / прокси-изображения",
                "pt": "Alterado: defaultTheme e control.theme estavam em conflito. Agora control.theme é definido ao selecionar um novo tema padrão.\nAdicionado: control.themeDark para controlar dispositivos no modo escuro também.\nCorrigido: ícones de dispositivo com autenticação agora funcionam\nAlterado: anteriormente, apenas o usuário administrador podia alterar a configuração do lovelace. Agora também o proprietário do objeto de configuração e os membros do groupd do proprietário têm permissão para alterar a IU.\nLimpeza de código interno / atualização de dependência de quebra.\nAdicionado: Suporte para sensores de umidade pura.\nAdicionado: Suporte para URL como entity_image\nCorrigido: Ajustar handlig de nome de usuário / id de usuário para mudanças no js-controller\nFixo: os temas padrão não são exibidos como selecionados\nCorrigido: Carregando temas / cartões personalizados / proxy de imagem",
                "nl": "Veranderd: defaultTheme en control.theme waren in conflict. Nu wordt control.theme ingesteld bij het selecteren van een nieuw standaardthema.\nToegevoegd: control.themeDark om ook apparaten in de donkere modus te bedienen.\nOpgelost: apparaatpictogrammen met authenticatie werken nu\nVeranderd: voorheen kon alleen de admin-gebruiker de lovelace-configuratie wijzigen. Nu mogen ook de eigenaar van het configuratieobject en leden van de eigenaarsgroep de gebruikersinterface wijzigen.\nUpdate van interne code opschonen / verbreken van afhankelijkheid.\nToegevoegd: ondersteuning voor zuivere vochtigheidssensoren.\nToegevoegd: ondersteuning voor URL als entity_image\nOpgelost: pas gebruikersnaam / gebruiker-id handlig aan wijzigingen in js-controller aan\nOpgelost: standaardthema's worden niet weergegeven zoals geselecteerd\nOpgelost: thema's / aangepaste kaarten / afbeeldingsproxy laden",
                "fr": "Modifié: defaultTheme et control.theme étaient en conflit. Maintenant, control.theme est défini lors de la sélection d'un nouveau thème par défaut.\nAjouté: control.themeDark pour contrôler également les appareils en mode sombre.\nCorrection: les icônes de périphérique avec authentification fonctionnent maintenant\nChangé: auparavant, seul l'utilisateur admin pouvait changer la configuration de lovelace. Désormais, le propriétaire de l'objet de configuration et les membres du groupe propriétaire sont également autorisés à modifier l'interface utilisateur.\nNettoyage du code interne / mise à jour des dépendances de rupture.\nAjouté: Prise en charge des capteurs d'humidité purs.\nAjouté: prise en charge de l'URL en tant que entity_image\nCorrection: Ajustez le handlig du nom d'utilisateur / identifiant d'utilisateur aux changements dans js-controller\nCorrection: les thèmes par défaut ne s'affichent pas comme sélectionnés\nCorrection: chargement de thèmes / cartes personnalisées / image-proxy",
                "it": "Modificato: defaultTheme e control.theme erano in conflitto. Ora control.theme è impostato quando si seleziona un nuovo tema predefinito.\nAggiunto: control.themeDark per controllare anche i dispositivi in modalità oscura.\nRisolto: le icone dei dispositivi con autenticazione ora funzionano\nModificato: in precedenza solo l'utente amministratore poteva modificare la configurazione di lovelace. Ora anche il proprietario dell'oggetto di configurazione e i membri del proprietario groupd possono modificare l'interfaccia utente.\nPulizia del codice interno / aggiornamento delle dipendenze interrotto.\nAggiunto: supporto per sensori di umidità pura.\nAggiunto: supporto per URL come entity_image\nRisolto: modifica la gestione del nome utente / id utente alle modifiche in js-controller\nRisolto: i temi predefiniti non vengono visualizzati come selezionati\nRisolto: caricamento di temi / schede personalizzate / proxy di immagini",
                "es": "Cambiado: defaultTheme y control.theme estaban en conflicto. Ahora control.theme se establece al seleccionar un nuevo tema predeterminado.\nAgregado: control.themeDark para controlar dispositivos en modo oscuro también.\nCorregido: los iconos de dispositivos con autenticación ahora funcionan\nModificado: anteriormente, solo el usuario administrador podía cambiar la configuración de Lovelace. Ahora también el propietario del objeto de configuración y los miembros del grupo propietario pueden cambiar la interfaz de usuario.\nLimpieza de código interno / actualización de dependencia de ruptura.\nAgregado: Soporte para sensores de humedad pura.\nAgregado: Soporte para URL como entity_image\nCorregido: ajuste el handlig del nombre de usuario / id de usuario a los cambios en js-controller\nCorregido: los temas predeterminados no se muestran como seleccionados\nCorregido: carga de temas / tarjetas personalizadas / proxy de imagen",
                "pl": "Zmieniono: defaultTheme i control.theme były w konflikcie. Teraz control.theme jest ustawiana przy wyborze nowego domyślnego motywu.\nDodano: control.themeDark do sterowania urządzeniami również w trybie ciemnym.\nNaprawiono: ikony urządzeń z uwierzytelnianiem działają teraz\nZmieniono: poprzednio tylko administrator mógł zmienić konfigurację lovelace. Teraz również właściciel obiektu konfiguracyjnego i członkowie grupy właścicieli mogą zmieniać interfejs użytkownika.\nWewnętrzne czyszczenie kodu / aktualizacja zależności.\nDodano: Wsparcie dla czystych czujników wilgotności.\nDodano: obsługę adresu URL jako entity_image\nNaprawiono: Dostosuj obsługę nazwy użytkownika / identyfikatora użytkownika do zmian w kontrolerze js\nNaprawiono: domyślne motywy nie są wyświetlane jako wybrane\nNaprawiono: ładowanie motywów / niestandardowych kart / proxy obrazu",
                "zh-cn": "更改：defaultTheme和control.theme发生冲突。现在，在选择新的默认主题时将设置control.theme。\n添加：control.themeDark也可以在黑暗模式下控制设备。\n固定：带有身份验证的设备图标现在可以使用\n更改：以前只有管理员用户可以更改lovelace配置。现在，还允许配置对象的所有者和所有者组的成员更改UI。\n内部代码清除/破坏依赖性更新。\n补充：支持纯湿度传感器。\n补充：支持URL作为entity_image\n固定：调整用户名/用户标识handlig以更改js-controller\n固定：默认主题不会显示为选中状态\n固定：加载主题/自定义卡片/图像代理"
            },
            "1.4.3": {
                "en": "Support of lovelace via ioBroker.pro",
                "de": "Unterstützung von Lovelace über ioBroker.pro",
                "ru": "Поддержка ловеласа через ioBroker.pro",
                "pt": "Suporte de lovelace via ioBroker.pro",
                "nl": "Ondersteuning van lovelace via ioBroker.pro",
                "fr": "Prise en charge de lovelace via ioBroker.pro",
                "it": "Supporto di lovelace tramite ioBroker.pro",
                "es": "Soporte de lovelace a través de ioBroker.pro",
                "pl": "Wsparcie lovelace przez ioBroker.pro",
                "zh-cn": "通过ioBroker.pro支持lovelace"
            },
            "1.4.2": {
                "en": "Fixed: set Theme state type to string instead of text",
                "de": "Behoben: Setzen Sie den Theme-Statustyp auf String anstelle von Text",
                "ru": "Исправлено: установить тип состояния темы на строку вместо текста.",
                "pt": "Fixo: definir o tipo de estado do tema para string em vez de texto",
                "nl": "Opgelost: stel het thema staatstype in op string in plaats van op tekst",
                "fr": "Correction: définissez le type d'état du thème sur chaîne au lieu de texte",
                "it": "Risolto: imposta il tipo di stato del tema su stringa anziché testo",
                "es": "Corregido: establezca el tipo de estado del tema en una cadena en lugar de texto",
                "pl": "Naprawiono: ustaw typ stanu motywu na ciąg zamiast tekstu",
                "zh-cn": "固定：将主题状态类型设置为字符串而不是文本"
            },
            "1.4.1": {
                "en": "Support of new Let's Encrypt (only with js-controller 3.2.x)",
                "de": "Unterstützung des neuen Let's Encrypt (nur mit js-controller 3.2.x)",
                "ru": "Поддержка нового Let's Encrypt (только с js-controller 3.2.x)",
                "pt": "Suporte do novo Let's Encrypt (apenas com js-controller 3.2.x)",
                "nl": "Ondersteuning van nieuwe Let's Encrypt (alleen met js-controller 3.2.x)",
                "fr": "Prise en charge du nouveau Let's Encrypt (uniquement avec js-controller 3.2.x)",
                "it": "Supporto del nuovo Let's Encrypt (solo con js-controller 3.2.x)",
                "es": "Soporte del nuevo Let's Encrypt (solo con js-controller 3.2.x)",
                "pl": "Obsługa nowego Let's Encrypt (tylko z js-controller 3.2.x)",
                "zh-cn": "支持新的Let's Encrypt（仅适用于js-controller 3.2.x）"
            },
            "1.3.6": {
                "en": "Fixed: do not ignore devices deleted from iot / without smartName\nAdded: Support location devices with one GPS state in string form\nAdded: Support for log service, logs frontend errors in server log\nAdded: Support for service calls with multiple ids, i.e. header switch of elements card\nFixed: unique check for manual entities only checked instance 0. Made them a bit more userfriendly, too.\nAdded: Possibility to select theme during runtime / select default dark theme\nFixed: hideToolbar did hide tab bar, too\nAdded: Support for iobroker_say service call (allows tts in mini-mediaplayer card using platform iobroker)",
                "de": "Behoben: Geräte, die aus iot / ohne smartName gelöscht wurden, nicht ignorieren\nHinzugefügt: Unterstützt Ortungsgeräte mit einem GPS-Status in Zeichenfolgenform\nHinzugefügt: Unterstützung für Protokolldienst, Protokollierung von Frontend-Fehlern im Serverprotokoll\nHinzugefügt: Unterstützung für Serviceanrufe mit mehreren IDs, d. H. Header-Schalter der Elementkarte\nBehoben: eindeutige Prüfung für manuelle Entitäten nur Instanz 0 geprüft. Auch etwas benutzerfreundlicher gemacht.\nHinzugefügt: Möglichkeit zur Auswahl eines Themas zur Laufzeit / Auswahl eines dunklen Standardthemas\nBehoben: hideToolbar hat auch die Tab-Leiste ausgeblendet\nHinzugefügt: Unterstützung für den Serviceabruf iobroker_say (ermöglicht tts in Mini-Mediaplayer-Karten über die Plattform iobroker)",
                "ru": "Исправлено: не игнорировать устройства, удаленные из iot / без smartName\nДобавлено: поддержка устройств определения местоположения с одним состоянием GPS в строковой форме.\nДобавлено: поддержка службы журналов, журналы ошибок внешнего интерфейса в журнале сервера.\nДобавлено: поддержка сервисных вызовов с несколькими идентификаторами, т.е. переключение заголовка карточки элементов.\nИсправлено: уникальная проверка для ручных сущностей проверена только на экземпляре 0. Также они стали немного удобнее для пользователя.\nДобавлено: возможность выбрать тему во время выполнения / выбрать темную тему по умолчанию.\nИсправлено: hideToolbar также скрывал панель вкладок\nДобавлено: Поддержка вызова службы iobroker_say (позволяет использовать tts в карте mini-mediaplayer с использованием платформы iobroker).",
                "pt": "Fixo: não ignorar dispositivos excluídos do iot / sem smartName\nAdicionado: suporte a dispositivos de localização com um estado de GPS em forma de string\nAdicionado: suporte para serviço de log, registra erros de front-end no log do servidor\nAdicionado: suporte para chamadas de serviço com vários ids, ou seja, troca de cabeçalho do cartão de elementos\nCorrigido: verificação única para entidades manuais verificadas apenas na instância 0. Tornou-as um pouco mais fáceis de usar também.\nAdicionado: Possibilidade de selecionar o tema durante a execução / selecionar o tema escuro padrão\nCorrigido: hideToolbar também ocultava a barra de guias\nAdicionado: suporte para chamada de serviço iobroker_say (permite tts no cartão mini-mediaplayer usando a plataforma iobroker)",
                "nl": "Opgelost: negeer apparaten die zijn verwijderd uit iot / zonder smartName niet\nToegevoegd: ondersteuning van locatieapparaten met één GPS-status in stringvorm\nToegevoegd: ondersteuning voor logboekservice, registreert frontend-fouten in het serverlogboek\nToegevoegd: ondersteuning voor serviceaanroepen met meerdere id's, d.w.z. header-switch van elementenkaart\nOpgelost: unieke controle voor handmatige entiteiten heeft alleen instantie 0 aangevinkt. Maakte ze ook wat gebruiksvriendelijker.\nToegevoegd: mogelijkheid om thema te selecteren tijdens runtime / standaard donker thema te selecteren\nOpgelost: hideToolbar verbergde de tabbalk ook\nToegevoegd: ondersteuning voor iobroker_say servicecall (staat tts toe in mini-mediaplayer-kaart met behulp van platform iobroker)",
                "fr": "Corrigé: n'ignorez pas les appareils supprimés de l'iot / sans smartName\nAjouté: Prise en charge des périphériques de localisation avec un état GPS sous forme de chaîne\nAjouté: Prise en charge du service de journalisation, enregistre les erreurs de frontend dans le journal du serveur\nAjouté: Prise en charge des appels de service avec plusieurs identifiants, c'est-à-dire le commutateur d'en-tête de la carte d'éléments\nCorrection: la vérification unique des entités manuelles ne vérifiait que l'instance 0. Les rendait également un peu plus conviviales.\nAjouté: Possibilité de sélectionner le thème pendant l'exécution / sélectionner le thème sombre par défaut\nCorrection: hideToolbar masquait également la barre d'onglets\nAjouté: Prise en charge de l'appel de service iobroker_say (permet tts dans la carte mini-mediaplayer en utilisant la plate-forme iobroker)",
                "it": "Risolto: non ignorare i dispositivi cancellati da iot / senza smartName\nAggiunto: supporta dispositivi di localizzazione con uno stato GPS in forma di stringa\nAggiunto: supporto per il servizio di registro, registra gli errori di frontend nel registro del server\nAggiunto: supporto per chiamate di servizio con più ID, ad es. Cambio intestazione della scheda elementi\nRisolto: il controllo univoco per le entità manuali controllava solo l'istanza 0. Le rendeva anche un po 'più user friendly.\nAggiunto: possibilità di selezionare il tema durante il runtime / selezionare il tema scuro predefinito\nRisolto: hideToolbar nascondeva anche la barra delle schede\nAggiunto: supporto per la chiamata di servizio iobroker_say (consente tts nella scheda mini-mediaplayer utilizzando la piattaforma iobroker)",
                "es": "Corregido: no ignore los dispositivos eliminados de iot / sin smartName\nAgregado: admite dispositivos de ubicación con un estado de GPS en forma de cadena\nAgregado: soporte para el servicio de registro, registra errores de frontend en el registro del servidor\nAgregado: soporte para llamadas de servicio con múltiples identificadores, es decir, interruptor de encabezado de la tarjeta de elementos\nCorregido: la verificación única para entidades manuales solo verificó la instancia 0. También las hizo un poco más fáciles de usar.\nAgregado: posibilidad de seleccionar el tema durante el tiempo de ejecución / seleccionar el tema oscuro predeterminado\nCorregido: hideToolbar también ocultaba la barra de pestañas\nAgregado: Soporte para la llamada de servicio iobroker_say (permite tts en la tarjeta mini-mediaplayer usando la plataforma iobroker)",
                "pl": "Naprawiono: nie ignoruj urządzeń usuniętych z iot / bez smartName\nDodano: Obsługa urządzeń lokalizacyjnych z jednym stanem GPS w postaci ciągu\nDodano: Wsparcie dla usługi logów, loguje błędy frontendu w logu serwera\nDodano: Wsparcie dla zgłoszeń serwisowych z wieloma identyfikatorami, tj. Przełączanie nagłówka karty elementów\nNaprawiono: unikalne sprawdzanie jednostek ręcznych sprawdzało tylko instancję 0. Uczyniło je również nieco bardziej przyjaznymi dla użytkownika.\nDodano: Możliwość wyboru motywu podczas działania / wybierz domyślny ciemny motyw\nNaprawiono: hideToolbar ukrył również pasek zakładek\nDodano: Wsparcie dla wezwania serwisu iobroker_say (umożliwia tts na karcie mini-mediaplayer przy użyciu platformy iobroker)",
                "zh-cn": "修正：不要忽略从物联网中删除的设备/没有smartName的设备\n补充：支持具有字符串形式的一个GPS状态的定位设备\n补充：支持日志服务，在服务器日志中记录前端错误\n补充：支持具有多个ID的服务呼叫，即元素卡的标题开关\n修复：手动实体的唯一检查仅检查实例0。也使它们更加易于使用。\n补充：可以在运行时选择主题/选择默认的深色主题\n修复：hideToolbar也隐藏了标签栏\n补充：支持iobroker_say服务调用（允许使用iobroker平台在mini-mediaplayer卡中进行tts）"
            },
            "1.3.3": {
                "en": "Added/Fixed: Also subscribe states for custom:mini-graph-card and maybe others.",
                "de": "Hinzugefügt / Behoben: Abonnieren Sie auch Status für benutzerdefinierte: Mini-Grafikkarte und möglicherweise andere.",
                "ru": "Добавлено / исправлено: Также подписывайтесь на состояния для custom: mini-graph-card и, возможно, других.",
                "pt": "Adicionado / corrigido: também subscrever estados para custom: mini-placa gráfica e talvez outros.",
                "nl": "Toegevoegd / opgelost: abonneer ook staten voor aangepast: minigrafiekkaart en misschien andere.",
                "fr": "Ajouté / Corrigé: Abonnez-vous également aux états personnalisés: mini-graph-card et peut-être d'autres.",
                "it": "Aggiunto / Risolto: sottoscrivi anche gli stati per personalizzato: mini-grafico-card e forse altri.",
                "es": "Agregado / solucionado: también suscríbase a estados personalizados: tarjeta de mini-gráfico y tal vez otros.",
                "pl": "Dodano / naprawiono: również subskrybuj stany dla niestandardowych: karta mini-grafu i być może inne.",
                "zh-cn": "已添加/已修复：还为custom：mini-graph-card以及其他订阅状态。"
            },
            "1.3.2": {
                "en": "Fixed: Possible crash during device creation.",
                "de": "Behoben: Möglicher Absturz während der Geräteerstellung.",
                "ru": "Исправлено: возможный сбой при создании устройства.",
                "pt": "Corrigido: possível travamento durante a criação do dispositivo.",
                "nl": "Opgelost: mogelijke crash tijdens het maken van een apparaat.",
                "fr": "Correction: plantage possible lors de la création de l'appareil.",
                "it": "Risolto: possibile crash durante la creazione del dispositivo.",
                "es": "Corregido: posible bloqueo durante la creación del dispositivo.",
                "pl": "Naprawiono: możliwa awaria podczas tworzenia urządzenia.",
                "zh-cn": "修正：在设备创建过程中可能崩溃。"
            },
            "1.3.1": {
                "en": "Fixed: Issue with manually genereadte entity IDs (changed and could contain illegal characters)",
                "de": "Behoben: Problem mit manuell generierten Entitäts-IDs (geändert und kann unzulässige Zeichen enthalten)",
                "ru": "Исправлено: проблема с созданием идентификаторов объектов вручную (изменено и могло содержать недопустимые символы)",
                "pt": "Corrigido: problema com IDs de entidade gerados manualmente (alterados e podem conter caracteres ilegais)",
                "nl": "Opgelost: probleem met handmatig gegenereerde entiteits-ID's (gewijzigd en kan illegale tekens bevatten)",
                "fr": "Correction: problème avec les ID d'entité générés manuellement (modifiés et pourraient contenir des caractères illégaux)",
                "it": "Risolto: problema con gli ID entità generati manualmente (modificati e potrebbero contenere caratteri illegali)",
                "es": "Solucionado: problema con las ID de entidad generadas manualmente (cambiado y podría contener caracteres ilegales)",
                "pl": "Naprawiono: problem z ręcznymi identyfikatorami jednostek przypisanych do gatunku (zmieniony i może zawierać niedozwolone znaki)",
                "zh-cn": "修正：手动基因重新读取实体ID的问题（已更改，可能包含非法字符）"
            },
            "1.3.0": {
                "en": "Fixed: Revert changes in thermostat to make it working again\nFixed: Prevent crash on invalid call-service action\nFixed: Object changes are now reflected in entities and UI updated.\nAdded: Support for RGB Arrays (hue-extended).\nEnhancement: started refactoring of server.js - will take time, but make maintenance easier.\nChange: Notifications are now cached in adapter, makes responses a bit faster\nEnhancement: Updated to lovelace 20201021.4",
                "de": "Behoben: Änderungen am Thermostat rückgängig machen, damit er wieder funktioniert\nBehoben: Absturz bei ungültiger Call-Service-Aktion verhindern\nBehoben: Objektänderungen werden jetzt in Entitäten und aktualisierten Benutzeroberflächen wiedergegeben.\nHinzugefügt: Unterstützung für RGB-Arrays (Farbton erweitert).\nVerbesserung: Das Refactoring von server.js wurde gestartet. Dies dauert einige Zeit, erleichtert jedoch die Wartung.\nÄnderung: Benachrichtigungen werden jetzt im Adapter zwischengespeichert, wodurch die Antworten etwas schneller werden\nVerbesserung: Aktualisiert auf Lovelace 20201021.4",
                "ru": "Исправлено: отменить изменения в термостате, чтобы он снова заработал.\nИсправлено: предотвращение сбоя при недопустимом действии службы вызова.\nИсправлено: изменения объектов теперь отражаются в объектах, а пользовательский интерфейс обновлен.\nДобавлено: поддержка массивов RGB (расширенный оттенок).\nУлучшение: начат рефакторинг server.js - займет время, но упростит обслуживание.\nИзменение: уведомления теперь кешируются в адаптере, что делает ответы немного быстрее.\nУлучшение: Обновлено до lovelace 20201021.4",
                "pt": "Corrigido: reverter alterações no termostato para fazê-lo funcionar novamente\nCorrigido: evita falha em ação de serviço de chamada inválida\nCorrigido: as alterações do objeto agora são refletidas nas entidades e na IU atualizada.\nAdicionado: suporte para matrizes RGB (hue-extended).\nAprimoramento: refatoração iniciada de server.js - levará tempo, mas tornará a manutenção mais fácil.\nAlteração: as notificações agora são armazenadas em cache no adaptador, tornando as respostas um pouco mais rápidas\nAprimoramento: Atualizado para lovelace 20201021.4",
                "nl": "Opgelost: zet wijzigingen in de thermostaat terug om hem weer te laten werken\nOpgelost: voorkom crash bij ongeldige call-service-actie\nOpgelost: objectwijzigingen worden nu weerspiegeld in entiteiten en de gebruikersinterface is bijgewerkt.\nToegevoegd: ondersteuning voor RGB-arrays (hue-extended).\nVerbetering: begonnen met het herstructureren van server.js - kost tijd, maar maakt onderhoud eenvoudiger.\nVerandering: meldingen worden nu in de adapter opgeslagen, waardoor reacties iets sneller zijn\nVerbetering: bijgewerkt naar lovelace 20201021.4",
                "fr": "Correction: annulez les modifications du thermostat pour le faire fonctionner à nouveau\nCorrigé: Empêcher le crash sur une action de service d'appel invalide\nCorrigé: les modifications d'objets sont désormais reflétées dans les entités et l'interface utilisateur mise à jour.\nAjouté: Prise en charge des tableaux RVB (extension de la teinte).\nAmélioration: a commencé la refactorisation de server.js - prendra du temps, mais facilitera la maintenance.\nModification: les notifications sont maintenant mises en cache dans l'adaptateur, accélère les réponses un peu\nAmélioration: mise à jour vers lovelace 20201021.4",
                "it": "Risolto: ripristina le modifiche al termostato per farlo funzionare di nuovo\nRisolto: impedisce l'arresto anomalo su un'azione di servizio di chiamata non valida\nRisolto: le modifiche agli oggetti ora si riflettono nelle entità e nell'interfaccia utente aggiornata.\nAggiunto: supporto per array RGB (tonalità estesa).\nMiglioramento: avviato il refactoring di server.js - richiederà tempo, ma renderà più facile la manutenzione.\nModifica: le notifiche sono ora memorizzate nella cache dell'adattatore, rendendo le risposte un po 'più veloci\nMiglioramento: aggiornato a lovelace 20201021.4",
                "es": "Corregido: revertir los cambios en el termostato para que vuelva a funcionar\nCorregido: evitar fallas en una acción de servicio de llamada no válida\nCorregido: los cambios de objetos ahora se reflejan en las entidades y la interfaz de usuario actualizada.\nAgregado: Soporte para matrices RGB (tono extendido).\nMejora: se inició la refactorización de server.js; llevará tiempo, pero facilitará el mantenimiento.\nCambio: las notificaciones ahora se almacenan en caché en el adaptador, hace que las respuestas sean un poco más rápidas\nMejora: actualizado a lovelace 20201021.4",
                "pl": "Naprawiono: Cofnij zmiany w termostacie, aby znów działał\nNaprawiono: Zapobiegaj awariom przy nieprawidłowej akcji wezwania pomocy\nNaprawiono: zmiany obiektów są teraz odzwierciedlane w jednostkach i zaktualizowanym interfejsie użytkownika.\nDodano: Wsparcie dla tablic RGB (rozszerzony odcień).\nUlepszenie: rozpoczęta refaktoryzacja server.js - zajmie trochę czasu, ale ułatwi konserwację.\nZmiana: powiadomienia są teraz zapisywane w pamięci podręcznej adaptera, dzięki czemu odpowiedzi są nieco szybsze\nUlepszenie: zaktualizowano do lovelace 20201021.4",
                "zh-cn": "固定：恢复恒温器的更改以使其再次工作\n固定：防止无效的呼叫服务操作崩溃\n修正：对象更改现在反映在实体和更新的用户界面中。\n补充：支持RGB阵列（色相扩展）。\n增强功能：开始重构server.js-需要时间，但使维护更容易。\n更改：通知现在缓存在适配器中，使响应速度更快\n增强功能：已更新为lovelace 20201021.4"
            },
            "1.2.7": {
                "en": "Fixed: manual dimmer lighTs did not work in some cases due to missing initialization of entity.state\nFixed/Changed: Testing infrastructure and dev-dependencies (work in progress)\nFixed: set default mode of thermostat to \"auto\". Should allow setting of temperature.\nFixed: Up/Down button on covers\nFixed: Issue with play/pause on media player and improve history\nAdded: Allow automatically generated dimmers without on/off state.\nFixed: In some occasions names of manually generated entities could crash the adapter\n",
                "de": "Behoben: Manuelle Dimmerleuchten funktionierten in einigen Fällen aufgrund fehlender Initialisierung von entity.state nicht\nBehoben / Geändert: Testen der Infrastruktur und der Entwicklungsabhängigkeiten (in Arbeit)\nBehoben: Standardmodus des Thermostats auf \"auto\" setzen. Sollte die Einstellung der Temperatur ermöglichen.\nBehoben: Auf / Ab-Taste auf den Deckblättern\nBehoben: Problem mit Wiedergabe / Pause auf dem Media Player und Verbesserung des Verlaufs\nHinzugefügt: Ermöglicht automatisch generierte Dimmer ohne Ein / Aus-Status.\nBehoben: In einigen Fällen konnten Namen von manuell generierten Entitäten den Adapter zum Absturz bringen\n",
                "ru": "Исправлено: ручные диммеры не работали в некоторых случаях из-за отсутствия инициализации entity.state\nИсправлено / Изменено: Тестирование инфраструктуры и зависимостей от разработчиков (в стадии разработки)\nИсправлено: установить режим термостата по умолчанию на «авто». Должен позволить установить температуру.\nИсправлено: кнопка вверх / вниз на обложках\nИсправлено: проблема с воспроизведением / паузой в медиаплеере и улучшением истории\nДобавлено: Разрешить автоматически генерируемые диммеры без состояния включения / выключения.\nИсправлено: в некоторых случаях имена созданных вручную объектов могли вызвать сбой адаптера.\n",
                "pt": "Corrigido: luzes dimmer manuais não funcionavam em alguns casos devido à falta de inicialização de entity.state\nCorrigido / alterado: infraestrutura de teste e dependências de desenvolvimento (trabalho em andamento)\nFixo: defina o modo padrão do termostato para \"automático\". Deve permitir o ajuste de temperatura.\nFixo: botão para cima / para baixo nas tampas\nCorrigido: problema com reproduzir / pausar no reprodutor de mídia e melhorar o histórico\nAdicionado: Permitir dimmers gerados automaticamente sem estado ligado / desligado.\nCorrigido: em algumas ocasiões, nomes de entidades geradas manualmente podem travar o adaptador\n",
                "nl": "Opgelost: handmatige dimmerlampen werkten in sommige gevallen niet vanwege een ontbrekende initialisatie van entity.state\nFixed / Changed: testen van infrastructuur en dev-afhankelijkheden (werk in uitvoering)\nOpgelost: stel de standaardmodus van de thermostaat in op \"auto\". Moet temperatuurinstelling mogelijk maken.\nOpgelost: knop Omhoog / Omlaag op covers\nOpgelost: probleem met afspelen / pauzeren op mediaspeler en geschiedenis verbeteren\nToegevoegd: Sta automatisch gegenereerde dimmers toe zonder aan / uit-status.\nOpgelost: in sommige gevallen konden namen van handmatig gegenereerde entiteiten de adapter doen crashen\n",
                "fr": "Correction: les lumières du gradateur manuel ne fonctionnaient pas dans certains cas en raison d'une initialisation manquante de entity.state\nCorrigé / modifié: test de l'infrastructure et des dépendances de développement (travail en cours)\nCorrection: réglez le mode par défaut du thermostat sur \"auto\". Devrait permettre le réglage de la température.\nCorrection: bouton Haut / Bas sur les couvertures\nCorrection: problème de lecture / pause sur le lecteur multimédia et amélioration de l'historique\nAjouté: autorise les gradateurs générés automatiquement sans état marche / arrêt.\nCorrection: dans certaines occasions, les noms d'entités générées manuellement pouvaient planter l'adaptateur\n",
                "it": "Risolto: le luci dimmer manuali non funzionavano in alcuni casi a causa della mancata inizializzazione di entity.state\nRisolto / Modificato: test dell'infrastruttura e delle dipendenze dello sviluppo (lavori in corso)\nRisolto: imposta la modalità predefinita del termostato su \"auto\". Dovrebbe consentire l'impostazione della temperatura.\nRisolto: pulsante su / giù sulle copertine\nRisolto: problema con la riproduzione / pausa sul lettore multimediale e miglioramento della cronologia\nAggiunto: Consenti dimmer generati automaticamente senza stato on / off.\nRisolto: in alcune occasioni i nomi di entità generate manualmente potevano causare il crash dell'adattatore\n",
                "es": "Corregido: las luces de atenuación manuales no funcionaban en algunos casos debido a que faltaba la inicialización de entity.state\nCorregido / modificado: prueba de infraestructura y dependencias de desarrollo (trabajo en curso)\nCorregido: establece el modo predeterminado del termostato en \"automático\". Debe permitir el ajuste de la temperatura.\nCorregido: botón arriba / abajo en las cubiertas\nSolucionado: problema con la reproducción / pausa en el reproductor multimedia y mejorar el historial\nAgregado: Permitir atenuadores generados automáticamente sin estado de encendido / apagado.\nCorregido: en algunas ocasiones, los nombres de entidades generadas manualmente podrían bloquear el adaptador\n",
                "pl": "Naprawiono: ręczne przyciemnianie świateł nie działało w niektórych przypadkach z powodu braku inicjalizacji entity.state\nNaprawiono / zmieniono: testowanie infrastruktury i zależności deweloperskich (praca w toku)\nNaprawiono: ustaw domyślny tryb termostatu na „auto”. Powinien pozwolić na ustawienie temperatury.\nNaprawiono: przycisk Góra / Dół na okładkach\nNaprawiono: problem z odtwarzaniem / wstrzymywaniem w odtwarzaczu multimedialnym i poprawianiem historii\nDodano: Zezwalaj na automatycznie generowane ściemniacze bez stanu włączenia / wyłączenia.\nNaprawiono: w niektórych przypadkach nazwy ręcznie generowanych obiektów mogły spowodować awarię adaptera\n",
                "zh-cn": "修正：手动调光器在某些情况下由于缺少对object.state的初始化而无法正常工作\n固定/更改：测试基础结构和开发依赖性（正在进行的工作）\n固定：将恒温器的默认模式设置为“自动”。应该允许设定温度。\n固定：封面上的向上/向下按钮\n固定：媒体播放器上播放/暂停的问题并改善历史记录\n补充：允许自动生成的调光器没有开/关状态。\n修复：在某些情况下，手动生成的实体的名称可能会使适配器崩溃\n"
            },
            "1.2.6": {
                "en": "* (Garfonso) Fixed: invalid date in weather cards\n* (Garfonso) Fixed: issues with space in manual entity names.\n",
                "de": "* (Garfonso) Behoben: Ungültiges Datum in Wetterkarten\n* (Garfonso) Behoben: Probleme mit dem Leerzeichen in manuellen Entitätsnamen.\n",
                "ru": "* (Garfonso) Исправлено: неверная дата в погодных картах\n* (Garfonso) Исправлено: проблемы с пробелом в ручных именах объектов.\n",
                "pt": "* (Garfonso) Fixo: data inválida nos cartões meteorológicos\n* (Garfonso) Corrigido: problemas com espaço em nomes de entidades manuais.\n",
                "nl": "* (Garfonso) Opgelost: ongeldige datum in weerkaarten\n* (Garfonso) Opgelost: problemen met ruimte in handmatige entiteitsnamen.\n",
                "fr": "* (Garfonso) Correction: date invalide dans les cartes météo\n* (Garfonso) Correction: problèmes d'espace dans les noms d'entités manuelles.\n",
                "it": "* (Garfonso) Risolto: data non valida nelle carte meteo\n* (Garfonso) Risolto: problemi con lo spazio nei nomi delle entità manuali.\n",
                "es": "* (Garfonso) Corregido: fecha no válida en tarjetas meteorológicas\n* (Garfonso) Solucionado: problemas con el espacio en los nombres de entidades manuales.\n",
                "pl": "* (Garfonso) Naprawiono: nieprawidłowa data w kartach pogody\n* (Garfonso) Naprawiono: problemy ze spacjami w ręcznych nazwach jednostek.\n",
                "zh-cn": "*（Garfonso）修正：天气卡中的日期无效\n*（Garfonso）已修复：手动实体名称中的空格存在问题。\n"
            },
            "1.2.5": {
                "en": "* (Garfonso) Fixed: Parse initial values the same way as state changes\n* (Garfonso) Added: Work around for (old) common.states of type string",
                "de": "* (Garfonso) Behoben: Analysieren Sie Anfangswerte genauso wie Statusänderungen\n* (Garfonso) Hinzugefügt: Umgehen für (alte) common.states vom Typ string",
                "ru": "* (Гарфонсо) Исправлено: парсинг начальных значений так же, как изменения состояния\n* (Гарфонсо) Добавлено: Обойти (старые) common.states типа string",
                "pt": "* (Garfonso) Fixo: Analisa os valores iniciais da mesma maneira que as mudanças de estado\n* (Garfonso) Adicionado: solução alternativa para common.states (antigos) do tipo string",
                "nl": "* (Garfonso) Opgelost: ontleed de beginwaarden op dezelfde manier als de status verandert\n* (Garfonso) Toegevoegd: werk rond voor (oude) common.states van het type string",
                "fr": "* (Garfonso) Corrigé: analyser les valeurs initiales de la même manière que les changements d'état\n* (Garfonso) Ajouté: Contournement des (anciens) états communs de type chaîne",
                "it": "* (Garfonso) Risolto: analizza i valori iniziali nello stesso modo in cui cambia lo stato\n* (Garfonso) Aggiunto: aggirare per (vecchi) common.states di tipo stringa",
                "es": "* (Garfonso) Corregido: Analiza los valores iniciales de la misma manera que los cambios de estado\n* (Garfonso) Agregado: Solución para (viejos) estados comunes. De tipo cadena",
                "pl": "* (Garfonso) Naprawiono: Analizuj wartości początkowe w taki sam sposób, jak zmiany stanu\n* (Garfonso) Dodano: Obejście dla (starych) common.states typu ciąg znaków",
                "zh-cn": "*（Garfonso）固定：解析初始值的方式与更改状态相同\n*（Garfonso）添加：解决字符串类型的（旧）common.states"
            },
            "1.2.4": {
                "en": "* (Garfonso) Fixed: corrected hass_frontend files and directory\n* (Garfonso) Fixed: Prevent warning and possible crash",
                "de": "* (Garfonso) Behoben: hass_frontend Dateien und Verzeichnis korrigiert\n* (Garfonso) Behoben: Warnung und möglichen Absturz verhindern",
                "ru": "* (Гарфонсо) Исправлено: исправлены файлы и каталог hass_frontend\n* (Гарфонсо) Исправлено: предотвращение предупреждения и возможного сбоя",
                "pt": "* (Garfonso) Corrigido: arquivos e diretório hass_frontend corrigidos\n* (Garfonso) Corrigido: Impedir aviso e possível falha",
                "nl": "* (Garfonso) Opgelost: gecorrigeerde hass_frontend-bestanden en directory\n* (Garfonso) Opgelost: voorkom waarschuwing en mogelijke crash",
                "fr": "* (Garfonso) Corrigé: fichiers et répertoire hass_frontend corrigés\n* (Garfonso) Corrigé: Empêche l'avertissement et un éventuel crash",
                "it": "* (Garfonso) Risolto: file e directory hass_frontend corretti\n* (Garfonso) Risolto: impedisce l'avvertimento e il possibile arresto anomalo",
                "es": "* (Garfonso) Corregido: corregido hass_frontend archivos y directorio\n* (Garfonso) Corregido: prevenir advertencia y posible bloqueo",
                "pl": "* (Garfonso) Naprawiono: poprawiono pliki i katalog hass_frontend\n* (Garfonso) Naprawiono: Zapobiegaj ostrzeżeniom i możliwym awariom",
                "zh-cn": "*（Garfonso）固定：更正了hass_frontend文件和目录\n*（Garfonso）固定：防止警告和可能的崩溃"
            },
            "1.2.3": {
                "en": "* (Garfonso) Added: config to select direction of blinds.\n* (Garfonso) Fixed: missing translation of binary_sensor.states\n* (Garfonso) Fixed: History Graph diagrams for sensor-entities",
                "de": "* (Garfonso) Hinzugefügt: config zur Auswahl der Richtung der Jalousien.\n* (Garfonso) Behoben: fehlende Übersetzung von binary_sensor.states\n* (Garfonso) Behoben: Verlaufsdiagramme für Sensorentitäten",
                "ru": "* (Гарфонсо) Добавлено: конфигурация для выбора направления жалюзи.\n* (Гарфонсо) Исправлено: отсутствует перевод файла binary_sensor.states\n* (Гарфонсо) Исправлено: Диаграмма Графика истории для сенсорных объектов",
                "pt": "* (Garfonso) Adicionado: config para selecionar a direção dos blinds.\n* (Garfonso) Corrigido: falta de tradução do binary_sensor.states\n* (Garfonso) Corrigido: Diagramas de gráficos históricos para entidades sensoras",
                "nl": "* (Garfonso) Toegevoegd: config om de richting van de blinds te selecteren.\n* (Garfonso) Opgelost: ontbrekende vertaling van binary_sensor.states\n* (Garfonso) Fixed: History Graph diagrams voor sensor-entiteiten",
                "fr": "* (Garfonso) Ajouté: config pour sélectionner la direction des stores.\n* (Garfonso) Corrigé: traduction manquante de binary_sensor.states\n* (Garfonso) Corrigé: Diagrammes de graphique d'historique pour les entités de capteur",
                "it": "* (Garfonso) Aggiunto: config per selezionare la direzione dei bui.\n* (Garfonso) Risolto: mancava la traduzione di binary_sensor.states\n* (Garfonso) Risolto: diagrammi del grafico cronologico per entità sensore",
                "es": "* (Garfonso) Agregado: configuración para seleccionar la dirección de las persianas.\n* (Garfonso) Corregido: falta la traducción de binary_sensor.states\n* (Garfonso) Corregido: diagramas de gráficos de historia para entidades de sensores",
                "pl": "* (Garfonso) Dodano: konfiguracja, aby wybrać kierunek żaluzji.\n* (Garfonso) Naprawiono: brak tłumaczenia binary_sensor.states\n* (Garfonso) Naprawiono: Wykresy historii dla encji czujnikowych",
                "zh-cn": "*（Garfonso）添加：配置以选择百叶窗的方向。\n*（Garfonso）固定：缺少binary_sensor.states的翻译\n*（Garfonso）固定：传感器实体的历史图表图"
            },
            "1.2.2": {
                "en": "* (Garfonso) Fixed: Notification-drawer was to wide on narrow screens\n* (Garfonso) Fixed: Clear-all notifications button now has its icon again\n* (Garfonso) Fixed: Notification-button could move unpredictable in toolbar\n* (Garfonso) Fixed: Lock status is now displayed in icon (open/close)\n* (Garfonso) Fixed: Lock status is now received if no dedicated getId exists (by subscribing setId like with other entities)\n* (Garfonso) Added: Support for open-service call (which is not yet? supported in lovelace itself...)",
                "de": "* (Garfonso) Behoben: Benachrichtigungs-Schublade war auf schmalen Bildschirmen zu breit\n* (Garfonso) Behoben: Die Schaltfläche Alle Benachrichtigungen löschen hat jetzt wieder ihr Symbol\n* (Garfonso) Behoben: Die Benachrichtigungsschaltfläche konnte sich in der Symbolleiste unvorhersehbar bewegen\n* (Garfonso) Behoben: Der Sperrstatus wird jetzt im Symbol angezeigt (Öffnen / Schließen).\n* (Garfonso) Behoben: Der Sperrstatus wird jetzt empfangen, wenn keine dedizierte getId vorhanden ist (durch Abonnieren von setId wie bei anderen Entitäten).\n* (Garfonso) Hinzugefügt: Unterstützung für Open-Service-Anrufe (was noch nicht in Lovelace selbst unterstützt wird ...)",
                "ru": "* (Гарфонсо) Исправлено: ящик уведомлений был широким на узких экранах\n* (Garfonso) Исправлено: кнопка «Очистить все уведомления» теперь снова имеет свой значок\n* (Гарфонсо) Исправлено: кнопка уведомлений может перемещаться непредсказуемо на панели инструментов\n* (Гарфонсо) Исправлено: статус блокировки теперь отображается в значке (открыть / закрыть)\n* (Garfonso) Исправлено: статус блокировки теперь получен, если не существует выделенного getId (путем подписки setId, как с другими сущностями)\n* (Гарфонсо) Добавлено: Поддержка вызова с открытым сервисом (который еще не поддерживается в самом lovelace ...)",
                "pt": "* (Garfonso) Corrigido: a gaveta de notificações era larga em telas estreitas\n* (Garfonso) corrigido: o botão Limpar todas as notificações agora tem seu ícone novamente\n* (Garfonso) Corrigido: Botão de notificação pode se mover imprevisível na barra de ferramentas\n* (Garfonso) Fixo: o status do bloqueio agora é exibido no ícone (abrir / fechar)\n* (Garfonso) Corrigido: o status de bloqueio agora é recebido se não existir um getId dedicado (assinando setId como com outras entidades)\n* (Garfonso) Adicionado: suporte para chamada de serviço aberto (que ainda não é? Suportado no próprio aplicativo ...)",
                "nl": "* (Garfonso) Opgelost: Meldingslade was te breed op smalle schermen\n* (Garfonso) Opgelost: de knop voor alle meldingen wissen heeft nu weer een pictogram\n* (Garfonso) Opgelost: de meldingsknop kan onvoorspelbaar in de werkbalk bewegen\n* (Garfonso) opgelost: de vergrendelingsstatus wordt nu weergegeven in het pictogram (openen / sluiten)\n* (Garfonso) Opgelost: de vergrendelingsstatus wordt nu ontvangen als er geen speciale getId bestaat (door je in te schrijven zoals bij andere entiteiten)\n* (Garfonso) Toegevoegd: Ondersteuning voor open-servicegesprek (wat nog niet wordt ondersteund in lovelace zelf ...)",
                "fr": "* (Garfonso) Corrigé: le tiroir de notification était trop large sur des écrans étroits\n* (Garfonso) Corrigé: le bouton de notification d'effacement a maintenant de nouveau son icône\n* (Garfonso) Corrigé: le bouton de notification pouvait se déplacer de façon imprévisible dans la barre d'outils\n* (Garfonso) Corrigé: l'état de verrouillage est désormais affiché dans l'icône (ouvrir / fermer)\n* (Garfonso) Corrigé: le statut de verrouillage est désormais reçu si aucun getId dédié n'existe (en souscrivant setId comme avec d'autres entités)\n* (Garfonso) Ajouté: Prise en charge des appels à service ouvert (qui n'est pas encore pris en charge dans Lovelace lui-même ...)",
                "it": "* (Garfonso) Risolto: il cassetto delle notifiche era troppo largo su schermi stretti\n* (Garfonso) Risolto: il pulsante Cancella tutte le notifiche ora ha di nuovo la sua icona\n* (Garfonso) Risolto: il pulsante di notifica poteva spostarsi in modo imprevedibile nella barra degli strumenti\n* (Garfonso) Risolto: lo stato di blocco è ora visualizzato nell'icona (apri / chiudi)\n* (Garfonso) Risolto: lo stato di blocco ora viene ricevuto se non esiste alcun getId dedicato (sottoscrivendo setId come con altre entità)\n* (Garfonso) Aggiunto: Supporto per chiamate a servizio aperto (che non è ancora supportato nella stessa lovelace ...)",
                "es": "* (Garfonso) Corregido: el cajón de notificaciones era demasiado ancho en pantallas estrechas\n* (Garfonso) Corregido: el botón Borrar todas las notificaciones ahora tiene su icono nuevamente\n* (Garfonso) Corregido: el botón de notificación podía moverse de manera impredecible en la barra de herramientas\n* (Garfonso) Corregido: el estado de bloqueo ahora se muestra en el icono (abrir / cerrar)\n* (Garfonso) Corregido: el estado de bloqueo ahora se recibe si no existe un getId dedicado (suscribiendo setId como con otras entidades)\n* (Garfonso) Agregado: Soporte para llamadas de servicio abierto (que aún no es compatible con el propio lovelace ...)",
                "pl": "* (Garfonso) Naprawiono: Szuflada powiadomień była zbyt szeroka na wąskich ekranach\n* (Garfonso) Naprawiono: przycisk Wyczyść wszystkie powiadomienia ma teraz swoją ikonę ponownie\n* (Garfonso) Naprawiono: Przycisk powiadomień mógł się poruszać nieprzewidywalnie na pasku narzędzi\n* (Garfonso) Naprawiono: Status blokady jest teraz wyświetlany w ikonie (otwieranie / zamykanie)\n* (Garfonso) Naprawiono: Status blokady jest teraz odbierany, jeśli nie istnieje dedykowany getId (subskrybując setId jak w przypadku innych podmiotów)\n* (Garfonso) Dodano: Obsługa połączeń otwartych (które nie są jeszcze obsługiwane w samym Lovelace ...)",
                "zh-cn": "*（Garfonso）固定：通知抽屉在狭窄的屏幕上太宽\n*（Garfonso）固定：清除所有通知按钮现在再次具有其图标\n*（Garfonso）修复：通知按钮在工具栏中的移动可能无法预测\n*（Garfonso）固定：锁定状态现在显示在图标中（打开/关闭）\n*（Garfonso）修复：如果不存在专用的getId，则现在将收到锁定状态（通过像其他实体一样订阅setId）\n*（Garfonso）已添加：支持开放服务呼叫（尚不支持？lovelace本身支持...）"
            },
            "1.2.1": {
                "en": "* (Garfonso) Updated Hass Lovelace. Which fixes weather-card, no weather icons with authorization and (maybe?) store credentials\n* (Garfonso) Fix: yaml editor goes missing on Firefox \n* (Garfonso) Added: Support for new type of blinds (needs type-detector update)",
                "de": "* (Garfonso) Hass Lovelace wurde aktualisiert. Was behebt Wetterkarte, keine Wettersymbole mit Autorisierung und (vielleicht?) Anmeldeinformationen speichern\n* (Garfonso) Fix: Der Yaml-Editor geht in Firefox verloren\n* (Garfonso) Hinzugefügt: Unterstützung für neue Arten von Jalousien (Aktualisierung des Typdetektors erforderlich)",
                "ru": "* (Гарфонсо) Обновлен Хасс Ловелас. Что исправляет карту погоды, нет значков погоды с авторизацией и (возможно?) Учетными данными магазина\n* (Гарфонсо) Исправлено: редактор yaml пропадает в Firefox\n* (Гарфонсо) Добавлено: Поддержка нового типа жалюзи (требуется обновление детектора типа)",
                "pt": "* (Garfonso) Atualizado Hass Lovelace. Que corrige o cartão climático, sem ícones climáticos com autorização e (talvez?) Credenciais de loja\n* (Garfonso) Correção: o editor yaml desaparece no Firefox\n* (Garfonso) Adicionado: Suporte para novo tipo de persianas (precisa de atualização do detector de tipo)",
                "nl": "* (Garfonso) Hass Lovelace bijgewerkt. Welke repareert weerkaart, geen weerpictogrammen met autorisatie en (misschien?) Bewaarreferenties\n* (Garfonso) Fix: yaml-editor ontbreekt in Firefox\n* (Garfonso) Toegevoegd: Ondersteuning voor nieuw type jaloezieën (update van type-detector vereist)",
                "fr": "* (Garfonso) Mise à jour de Hass Lovelace. Qui corrige la carte météo, pas d'icônes météo avec autorisation et (peut-être?) Stocker les informations d'identification\n* (Garfonso) Correction: l'éditeur yaml disparaît sur Firefox\n* (Garfonso) Ajouté: Prise en charge d'un nouveau type de stores (nécessite une mise à jour du détecteur de type)",
                "it": "* (Garfonso) Aggiornato Hass Lovelace. Che risolve la scheda meteorologica, nessuna icona del tempo con autorizzazione e (forse?) Memorizza le credenziali\n* (Garfonso) Correzione: l'editor yaml scompare su Firefox\n* (Garfonso) Aggiunto: supporto per nuovo tipo di persiane (necessita di aggiornamento del rilevatore di tipo)",
                "es": "* (Garfonso) Actualizado Hass Lovelace. Lo que repara la tarjeta meteorológica, sin iconos meteorológicos con autorización y (¿tal vez?) Credenciales de la tienda\n* (Garfonso) Corrección: el editor yaml desaparece en Firefox\n* (Garfonso) Agregado: Soporte para nuevos tipos de persianas (necesita actualización de detector de tipo)",
                "pl": "* (Garfonso) Zaktualizowano Hass Lovelace. Który naprawia kartę pogody, brak ikon pogody z autoryzacją i (może?) Dane logowania\n* (Garfonso) Poprawka: w przeglądarce Firefox brakuje edytora yaml\n* (Garfonso) Dodano: Wsparcie dla nowego rodzaju żaluzji (wymaga aktualizacji detektora typu)",
                "zh-cn": "*（Garfonso）更新了Hass Lovelace。哪个可以修复天气卡，没有授权的天气图标和（也许？）存储凭据\n*（Garfonso）修复：Firefox上缺少yaml编辑器\n*（Garfonso）已添加：支持新型百叶窗（需要更新类型检测器）"
            },
            "1.2.0": {
                "en": "* (Garfonso) Added: Support for cover entity (cover and input_number entities are now created for blinds)\n* (Garfonso) Added: Support for new blind types which let lovelace determine direction of 0/100%\n* (Garfonso) Fixed: Prefer ON_LIGHT for lights if present, should fix cases where there is also a switch state in a light device.\n* (Garfonso) Added: Enable history support, let's more-info show history of states\n* (Garfonso) Added: zone.home entity from system.config (i.e. lat/long)\n* (Garfonso) Fixed: Make door devices create a device_class door entity\n* (Garfonso) Fixed: Added some missing translations, improved translation a bit, added domain name to translations in custom tab.",
                "de": "* (Garfonso) Hinzugefügt: Unterstützung für Cover-Entitäten (Cover- und Input-Nummer-Entitäten werden jetzt für Blinds erstellt)\n* (Garfonso) Hinzugefügt: Unterstützung für neue Blindtypen, bei denen die Liebe die Richtung von 0/100% bestimmen kann\n* (Garfonso) Behoben: Bevorzugen Sie ON_LIGHT für Lichter, falls vorhanden, sollten Fälle behoben werden, in denen auch in einem Lichtgerät ein Schaltzustand vorliegt.\n* (Garfonso) Hinzugefügt: Aktivieren Sie die Verlaufsunterstützung. Lassen Sie uns mehr Informationen zum Verlauf der Zustände anzeigen\n* (Garfonso) Hinzugefügt: zone.home-Entität aus system.config (d. H. Lat / long)\n* (Garfonso) Behoben: Türgeräte eine Türentität der Geräteklasse erstellen lassen\n* (Garfonso) Behoben: Einige fehlende Übersetzungen wurden hinzugefügt, die Übersetzung etwas verbessert und den Übersetzungen auf der benutzerdefinierten Registerkarte den Domainnamen hinzugefügt.",
                "ru": "* (Гарфонсо) Добавлено: Поддержка объекта покрытия (теперь для блайндов создаются объекты cover и input_number)\n* (Гарфонсо) Добавлено: Поддержка новых типов слепых, которые позволяют ловеласу определять направление 0/100%.\n* (Garfonso) Исправлено: предпочтение ON_LIGHT для источников света, если оно присутствует, должно исправлять случаи, когда в устройстве освещения также имеется состояние переключения.\n* (Гарфонсо) Добавлено: Включите поддержку истории, давайте больше информации покажем историю состояний\n* (Гарфонсо) Добавлено: сущность zone.home из system.config (т.е. широта / долгота)\n* (Гарфонсо) Исправлено: заставить дверные устройства создавать дверную сущность device_class\n* (Гарфонсо) Исправлено: добавлены некоторые недостающие переводы, немного улучшен перевод, добавлено доменное имя к переводам в пользовательской вкладке.",
                "pt": "* (Garfonso) Adicionado: Suporte para entidade de cobertura (entidades de cobertura e número de entrada agora são criadas para blinds)\n* (Garfonso) Adicionado: Suporte para novos tipos de blinds que permitem ao lovelace determinar a direção de 0/100%\n* (Garfonso) Corrigido: Prefira ON_LIGHT para luzes, se houver, deve corrigir casos em que também há um estado de comutação em um dispositivo de luz.\n* (Garfonso) Adicionado: ative o suporte ao histórico, vamos mostrar mais informações do histórico dos estados\n* (Garfonso) Adicionado: entidade zone.home do system.config (ou seja, lat / long)\n* (Garfonso) Corrigido: Faça com que os dispositivos de porta criem uma entidade de porta device_class\n* (Garfonso) Corrigido: Adicionadas algumas traduções ausentes, melhorada um pouco a tradução, adicionado nome de domínio às traduções na guia personalizada.",
                "nl": "* (Garfonso) Toegevoegd: Ondersteuning voor coverentiteit (cover- en input_number-entiteiten zijn nu gemaakt voor blinds)\n* (Garfonso) Toegevoegd: Ondersteuning voor nieuwe blinde types die de lovelace de richting van 0/100% laten bepalen\n* (Garfonso) Opgelost: geef de voorkeur aan ON_LIGHT voor lichten indien aanwezig, moet gevallen oplossen waarin er ook een schakeltoestand is in een lichtapparaat.\n* (Garfonso) Toegevoegd: Schakel geschiedenisondersteuning in, laten we meer informatie de geschiedenis van staten tonen\n* (Garfonso) Toegevoegd: zone.home-entiteit van system.config (d.w.z. lat / long)\n* (Garfonso) Opgelost: laat deurapparaten een deureenheid device_class maken\n* (Garfonso) Opgelost: enkele ontbrekende vertalingen toegevoegd, verbeterde vertaling een beetje, domeinnaam toegevoegd aan vertalingen op aangepast tabblad.",
                "fr": "* (Garfonso) Ajouté: Prise en charge de l'entité de couverture (les entités de couverture et d'entrée_nombre sont maintenant créées pour les stores)\n* (Garfonso) Ajouté: Prise en charge de nouveaux types de stores qui permettent à Lovelace de déterminer la direction de 0/100%\n* (Garfonso) Corrigé: Préférez ON_LIGHT pour les lumières si elles sont présentes, devrait corriger les cas où il y a aussi un état de commutation dans un dispositif d'éclairage.\n* (Garfonso) Ajouté: Activer la prise en charge de l'historique, disons plus d'informations sur l'historique des états\n* (Garfonso) Ajouté: entité zone.home de system.config (c'est-à-dire lat / long)\n* (Garfonso) Corrigé: Faire que les dispositifs de porte créent une entité de porte device_class\n* (Garfonso) Correction: Ajout de quelques traductions manquantes, amélioration un peu de la traduction, ajout du nom de domaine aux traductions dans l'onglet personnalisé.",
                "it": "* (Garfonso) Aggiunto: Supporto per entità di copertura (le entità di copertina e input_number sono ora create per i blind)\n* (Garfonso) Aggiunto: Supporto per nuovi tipi ciechi che consentono alla lovelace di determinare la direzione dello 0/100%\n* (Garfonso) Risolto: preferisci ON_LIGHT per le luci, se presenti, dovrebbe risolvere i casi in cui c'è anche uno stato di commutazione in un dispositivo di illuminazione.\n* (Garfonso) Aggiunto: abilita il supporto della cronologia, mostriamo più informazioni sulla cronologia degli stati\n* (Garfonso) Aggiunto: entità zone.home da system.config (cioè lat / long)\n* (Garfonso) Risolto: i dispositivi delle porte creavano un'entità porta device_class\n* (Garfonso) Risolto: Aggiunte alcune traduzioni mancanti, migliorata un po 'la traduzione, aggiunto il nome di dominio alle traduzioni nella scheda personalizzata.",
                "es": "* (Garfonso) Agregado: Soporte para la entidad de cobertura (las entidades de cobertura y input_number ahora se crean para las persianas)\n* (Garfonso) Añadido: Soporte para nuevos tipos de ciegos que permiten que lovelace determine la dirección del 0/100%\n* (Garfonso) Corregido: prefiera ON_LIGHT para luces si está presente, debería solucionar los casos en los que también hay un estado de interruptor en un dispositivo de luz.\n* (Garfonso) Agregado: Habilite el soporte de historial, muestremos más información sobre el historial de estados\n* (Garfonso) Agregado: entidad zone.home desde system.config (es decir, lat / long)\n* (Garfonso) Corregido: Hacer que los dispositivos de puerta creen una entidad de puerta device_class\n* (Garfonso) Corregido: se agregaron algunas traducciones faltantes, se mejoró un poco la traducción, se agregó el nombre de dominio a las traducciones en la pestaña personalizada.",
                "pl": "* (Garfonso) Dodano: Obsługa encji ubezpieczeniowej (encja cover i liczba_wejściowa są teraz tworzone dla blindów)\n* (Garfonso) Dodano: Wsparcie dla nowych typów blindów, które pozwalają lovelace określić kierunek 0/100%\n* (Garfonso) Naprawiono: Preferuj ON_LIGHT dla świateł, jeśli są obecne, powinno naprawić przypadki, w których występuje również stan przełącznika w urządzeniu świetlnym.\n* (Garfonso) Dodano: Włącz obsługę historii, dowiedzmy się więcej o historii stanów\n* (Garfonso) Dodano: encja zone.home z system.config (tj. Lat / long)\n* (Garfonso) Naprawiono: Spraw, aby urządzenia drzwiowe tworzyły element drzwi_klasy device_class\n* (Garfonso) Naprawiono: Dodano trochę brakujących tłumaczeń, trochę poprawiono tłumaczenie, dodano nazwę domeny do tłumaczeń w zakładce niestandardowej.",
                "zh-cn": "*（Garfonso）已添加：支持封面实体（现在为盲人创建了cover和input_number实体）\n*（Garfonso）已添加：支持新的百叶窗类型，让lovelace确定方向为0/100％\n*（加芬索（Garfonso））修复：如果有灯光，则最好选择ON_LIGHT，如果存在灯光，应解决灯光设备中也存在开关状态的情况。\n*（Garfonso）已添加：启用历史记录支持，让我们更多信息显示状态历史记录\n*（Garfonso）已添加：system.config中的zone.home实体（即lat / long）\n*（Garfonso）固定：使门设备创建device_class门实体\n*（Garfonso）固定：添加了一些缺少的翻译，改进了一点翻译，在自定义标签中为翻译添加了域名。"
            },
            "1.1.0": {
                "en": "* (Garfonso) BREAKING: fixed issue with entity_id generation which now allows umlauts to be replaced by ue/ae/oe.\n* (Garfonso) added windowsTilt device type\n* (Garfonso) reworked friendly name for auto generated entities, allow space in name.\n* (Garfonso) use device_class feature for sensors (where applicable) -> results in translation features of lovelace being used.\n* (Garfonso) multiple fixes/additions to media player (like volume scaling, on/off support, shuffle support, stop support) \n",
                "de": "* (Garfonso) BREAKING: Problem mit der Entität entity_id behoben, durch das Umlaute jetzt durch ue / ae / oe ersetzt werden können.\n* (Garfonso) hat den WindowsTilt-Gerätetyp hinzugefügt\n* (Garfonso) Überarbeiteter Anzeigename für automatisch generierte Entitäten, lassen Sie Platz im Namen.\n* (Garfonso) verwendet die Funktion device_class für Sensoren (falls zutreffend) -> führt dazu, dass Übersetzungsfunktionen von Lovelace verwendet werden.\n* (Garfonso) mehrere Korrekturen / Ergänzungen zum Media Player (wie Lautstärkeskalierung, Ein / Aus-Unterstützung, Shuffle-Unterstützung, Stop-Unterstützung)\n",
                "ru": "* (Garfonso) BREAKING: исправлена проблема с генерацией entity_id, которая теперь позволяет заменять умлауты на ue / ae / oe.\n* (Гарфонсо) добавлен тип устройства windowsTilt\n* (Гарфонсо) переработанное понятное имя для автоматически сгенерированных сущностей, оставьте место в имени\n* (Гарфонсо) использовать функцию device_class для датчиков (где применимо) -> приводит к использованию функций перевода lovelace.\n* (Garfonso) несколько исправлений / дополнений в медиаплеере (например, масштабирование громкости, поддержка включения / выключения, поддержка перемешивания, поддержка остановки)\n",
                "pt": "* (Garfonso) BREAKING: problema corrigido com a geração entity_id, que agora permite que os tremas sejam substituídos por ue / ae / oe.\n* (Garfonso) adicionou o tipo de dispositivo windowsTilt\n* (Garfonso) reformulou o nome amigável para entidades geradas automaticamente, permite espaço no nome.\n* (Garfonso) usa o recurso device_class para sensores (quando aplicável) -> resulta no uso de recursos de tradução do lovelace.\n* (Garfonso) várias correções / adições ao media player (como redimensionamento de volume, suporte on / off, suporte a shuffle, suporte a interrupção)\n",
                "nl": "* (Garfonso) BREAKING: probleem opgelost met het genereren van entiteit_id waardoor umlauts nu kunnen worden vervangen door ue / ae / oe.\n* (Garfonso) toegevoegd windowsTilt apparaattype\n* (Garfonso) herwerkte vriendelijke naam voor automatisch gegenereerde entiteiten, laat ruimte in naam toe.\n* (Garfonso) gebruik device_class-functie voor sensoren (indien van toepassing) -> resulteert in vertaalfuncties van lovelace die worden gebruikt.\n* (Garfonso) meerdere fixes / toevoegingen aan mediaspeler (zoals volumeschaling, aan / uit-ondersteuning, shuffle-ondersteuning, stop-ondersteuning)\n",
                "fr": "* (Garfonso) BREAKING: correction d'un problème avec la génération entity_id qui permet désormais de remplacer les trémas par ue / ae / oe.\n* (Garfonso) a ajouté le type d'appareil windowsTilt\n* (Garfonso) nom convivial retravaillé pour les entités générées automatiquement, laissez de l'espace dans le nom.\n* (Garfonso) utilise la fonction device_class pour les capteurs (le cas échéant) -> entraîne l'utilisation des fonctions de traduction de lovelace.\n* (Garfonso) plusieurs correctifs / ajouts au lecteur multimédia (comme la mise à l'échelle du volume, la prise en charge marche / arrêt, la prise en charge aléatoire, l'arrêt de la prise en charge)\n",
                "it": "* (Garfonso) BREAKING: risolto problema con la generazione entity_id che ora consente di sostituire le umlaut con ue / ae / oe.\n* (Garfonso) aggiunto il tipo di dispositivo windowsTilt\n* (Garfonso) rielaborato il nome descrittivo per le entità generate automaticamente, consente lo spazio nel nome.\n* (Garfonso) usa la funzione device_class per i sensori (dove applicabile) -> si traduce in funzioni di traduzione della lovelace in uso.\n* (Garfonso) più correzioni / aggiunte al lettore multimediale (come ridimensionamento del volume, supporto on / off, supporto shuffle, supporto stop)\n",
                "es": "* (Garfonso) BREAKING: se solucionó el problema con la generación entity_id que ahora permite que las diéresis sean reemplazadas por ue / ae / oe.\n* (Garfonso) agregó el tipo de dispositivo windowsTilt\n* (Garfonso) reelaborado el nombre descriptivo para las entidades generadas automáticamente, deje espacio en el nombre.\n* (Garfonso) usa la función device_class para los sensores (cuando corresponde) -> da como resultado que se usen las funciones de traducción de lovelace.\n* (Garfonso) múltiples correcciones / adiciones al reproductor multimedia (como escala de volumen, soporte de encendido / apagado, soporte aleatorio, detener soporte)\n",
                "pl": "* (Garfonso) ŁAMANIE: naprawiono problem z generowaniem bytu_id, który teraz pozwala na zastąpienie umlautów przez ue / ae / oe.\n* (Garfonso) dodano typ urządzenia WindowsTilt\n* (Garfonso) przerobiono przyjazną nazwę dla automatycznie generowanych encji, pozostaw miejsce w nazwie.\n* (Garfonso) użyj funkcji device_class dla czujników (w stosownych przypadkach) -> powoduje użycie funkcji tłumaczenia lovelace.\n* (Garfonso) wiele poprawek / dodatków do odtwarzacza multimedialnego (takich jak skalowanie głośności, obsługa włączania / wyłączania, obsługa odtwarzania losowego, obsługa zatrzymywania)\n",
                "zh-cn": "*（Garfonso）BREAKING：修复了Entity_id生成的问题，该问题现在允许将变音符号替换为ue / ae / oe。\n*（Garfonso）添加了WindowsTilt设备类型\n*（Garfonso）重命名了自动生成的实体的友好名称，名称中留有空格。\n*（Garfonso）对传感器使用device_class功能（如果适用）->导致使用lovelace的翻译功能。\n*（Garfonso）对媒体播放器的多项修复/添加（例如音量缩放，开/关支持，随机播放支持，停止支持）\n"
            },
            "1.0.16": {
                "en": "webserver initialization optimized again to prevent errors with invalid certificates",
                "de": "Die Webserver-Initialisierung wurde erneut optimiert, um Fehler mit ungültigen Zertifikaten zu vermeiden",
                "ru": "Инициализация веб-сервера снова оптимизирована для предотвращения ошибок с недействительными сертификатами",
                "pt": "inicialização do servidor da web otimizada novamente para evitar erros com certificados inválidos",
                "nl": "de initialisatie van de webserver is opnieuw geoptimaliseerd om fouten met ongeldige certificaten te voorkomen",
                "fr": "initialisation du serveur Web optimisée à nouveau pour éviter les erreurs avec des certificats invalides",
                "it": "inizializzazione del server web nuovamente ottimizzata per prevenire errori con certificati non validi",
                "es": "La inicialización del servidor web se optimizó nuevamente para evitar errores con certificados no válidos",
                "pl": "inicjalizacja serwera WWW została ponownie zoptymalizowana, aby zapobiec błędom z nieprawidłowymi certyfikatami",
                "zh-cn": "再次优化了Web服务器的初始化，以防止证书无效而出错"
            },
            "1.0.15": {
                "en": "errors on webserver initialization are handled properly",
                "de": "Fehler bei der Webserver-Initialisierung werden ordnungsgemäß behandelt",
                "ru": "ошибки при инициализации веб-сервера обрабатываются правильно",
                "pt": "erros na inicialização do servidor da web são tratados adequadamente",
                "nl": "fouten bij het initialiseren van de webserver worden correct afgehandeld",
                "fr": "les erreurs lors de l'initialisation du serveur Web sont gérées correctement",
                "it": "gli errori sull'inizializzazione del server web sono gestiti correttamente",
                "es": "los errores en la inicialización del servidor web se manejan correctamente",
                "pl": "błędy przy inicjalizacji serwera są obsługiwane poprawnie",
                "zh-cn": "网站服务器初始化错误得到正确处理"
            }
        },
        "title": "Visualization with Lovelace-UI",
        "titleLang": {
            "en": "Visualization with Lovelace-UI",
            "de": "Visualisierung mit Lovelace-UI",
            "ru": "Визуализация с помощью Lovelace-UI",
            "pt": "Visualização com Lovelace-UI",
            "nl": "Visualisatie met Lovelace-UI",
            "fr": "Visualisation avec Lovelace-UI",
            "it": "Visualizzazione con Lovelace-UI",
            "es": "Visualización con Lovelace-UI",
            "pl": "Wizualizacja za pomocą Lovelace-UI",
            "zh-cn": "使用Lovelace-UI进行可视化"
        },
        "desc": {
            "en": "With this adapter you can build visualization for ioBroker with Home Assistant Lovelace UI",
            "de": "Mit diesem Adapter können Sie eine Visualisierung für ioBroker mit der Home Assistant Lovelace-Benutzeroberfläche erstellen",
            "ru": "С помощью этого адаптера вы можете создавать визуализацию для ioBroker с Home Assistant Lovelace UI",
            "pt": "Com este adaptador você pode construir visualização para o ioBroker com o Home Assistant Lovelace UI",
            "nl": "Met deze adapter kunt u visualisatie bouwen voor ioBroker met Home Assistant Lovelace UI",
            "fr": "Avec cet adaptateur, vous pouvez créer une visualisation pour ioBroker avec Home Assistant Lovelace UI",
            "it": "Con questo adattatore puoi costruire la visualizzazione per ioBroker con l'interfaccia utente di Home Assistant Lovelace",
            "es": "Con este adaptador puede crear visualización para ioBroker con Home Assistant Lovelace UI",
            "pl": "Za pomocą tego adaptera możesz zbudować wizualizację dla ioBroker z interfejsem Home Assistant Lovelace",
            "zh-cn": "使用此适配器，您可以使用Home Assistant Lovelace UI为ioBroker构建可视化"
        },
        "authors": [
            "bluefox <dogafox@gmail.com>"
        ],
        "keywords": [
            "ioBroker",
            "template",
            "Smart Home",
            "home automation"
        ],
        "license": "Apache-2.0",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "lovelace.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.lovelace/master/admin/lovelace.png",
        "readme": "https://github.com/ioBroker/ioBroker.lovelace/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "visualization",
        "compact": true,
        "materialize": true,
        "supportCustoms": true,
        "messagebox": true,
        "localLink": "%protocol%://%ip%:%port%/",
        "welcomeScreen1": {
            "link": "",
            "name": "Lovelace",
            "img": "lovelace/icons/favicon-192x192.png",
            "color": "#03a9f4",
            "order": 2,
            "localLink": true
        },
        "dependencies": [
            {
                "admin": ">=3.0.0"
            },
            {
                "js-controller": ">=2.0.0"
            }
        ],
        "welcomeScreenPro": {
            "link": "lovelace/",
            "name": "Lovelace",
            "img": "lovelace.admin/lovelace.png",
            "color": "#03a9f4",
            "order": 6,
            "localLink": true
        }
    },
    "native": {
        "history": "",
        "port": 8091,
        "auth": false,
        "secure": false,
        "bind": "0.0.0.0",
        "certPublic": "",
        "certPrivate": "",
        "certChained": "",
        "defaultUser": "admin",
        "onlyAllowWhenUserIsOwner": false,
        "ttl": 3600,
        "themes": "",
        "defaultTheme": "default",
        "defaultThemeDark": "default",
        "hideHeader": false,
        "leEnabled": false,
        "leUpdate": false,
        "leCheckPort": 80,
        "aliayOnly": false,
        "blindsInvert": false
    },
    "objects": [
        {
            "_id": "_design/custom",
            "language": "javascript",
            "views": {
                "state": {
                    "map": "function(doc) { doc.type === 'state' && doc.common && doc.common.custom && emit(doc._id, doc.common.custom) }"
                }
            }
        }
    ],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "connected",
            "type": "state",
            "common": {
                "name": "Info about connected socket clients",
                "type": "string",
                "read": true,
                "write": false,
                "role": "text"
            }
        },
        {
            "_id": "info.entitiesUpdated",
            "type": "state",
            "common": {
                "name": "If the list of entities was updated",
                "type": "boolean",
                "read": true,
                "write": false,
                "role": "state"
            }
        },
        {
            "_id": "",
            "type": "meta",
            "common": {
                "name": "user files and images for lovelace",
                "type": "meta.user"
            },
            "native": {}
        },
        {
            "_id": "configuration",
            "type": "channel",
            "common": {
                "name": "Storage"
            },
            "native": {}
        },
        {
            "_id": "session",
            "type": "state",
            "common": {
                "name": "Oauth2 Session",
                "type": "json",
                "role": "state"
            },
            "native": {}
        },
        {
            "_id": "conversation",
            "type": "state",
            "common": {
                "name": "Question and answer for conversation ",
                "desc": "Question and answer for conversation dialog. See readme for how to use.",
                "desc1": {
                    "en": "Question and answer for conversation dialog. See readme for how to use.",
                    "de": "Frage und Antwort zum Gesprächsdialog. Informationen zur Verwendung finden Sie in der Readme-Datei.",
                    "ru": "Вопрос и ответ для диалога. Смотрите readme для того, чтобы использовать.",
                    "pt": "Perguntas e respostas para o diálogo de conversação. Consulte o leia-me para saber como usar.",
                    "nl": "Vraag en antwoord voor gespreksdialoog. Zie leesmij voor gebruik.",
                    "fr": "Question et réponse pour le dialogue de conversation. Voir le readme pour savoir comment l'utiliser.",
                    "it": "Domanda e risposta per la finestra di dialogo di conversazione. Vedi il file Leggimi per come usare.",
                    "es": "Preguntas y respuestas para el diálogo de conversación. Consulte el archivo Léame para saber cómo usarlo.",
                    "pl": "Pytania i odpowiedzi do dialogu rozmowy. Zobacz, jak używać.",
                    "zh-cn": "对话对话框的问答。有关使用方法，请参见自述文件。"
                },
                "type": "string",
                "role": "state"
            },
            "native": {}
        },
        {
            "_id": "control",
            "type": "channel",
            "common": {
                "name": "Control lovelace"
            },
            "native": {}
        },
        {
            "_id": "control.instance",
            "type": "state",
            "common": {
                "name": "Control lovelace",
                "type": "string",
                "desc": "Write here browser instance ID to control or 'FFFFFFFF' to control all instances"
            },
            "native": {}
        },
        {
            "_id": "control.command",
            "type": "state",
            "common": {
                "name": "Command for lovelace",
                "type": "string",
                "desc": "Writing this variable act as the trigger. Instance and data must be preset before 'command' will be written. 'changedView' will be signalled too",
                "states": {
                    "alert": "alert",
                    "changeView": "changeView",
                    "refresh": "refresh",
                    "reload": "reload",
                    "dialog": "dialog",
                    "popup": "popup",
                    "playSound": "playSound",
                    "changedView": "changedView",
                    "tts": "tts"
                }
            },
            "native": {}
        },
        {
            "_id": "control.data",
            "type": "state",
            "common": {
                "name": "Data for control lovelace",
                "type": "string",
                "desc": "Used for: alert, changeView, dialog, popup, playSound, changedView"
            },
            "native": {}
        },
        {
            "_id": "control.shopping_list",
            "type": "state",
            "common": {
                "name": "Shopping list as json",
                "type": "json",
                "write": true,
                "read": true,
                "desc": "Used for shopping list card"
            },
            "native": {}
        },
        {
            "_id": "control.alarm",
            "type": "state",
            "common": {
                "name": "alarm",
                "type": "boolean",
                "write": true,
                "read": true,
                "desc": "Arm or disarm with code",
                "def": false
            },
            "native": {
                "alarm_code": 1234
            }
        },
        {
            "_id": "control.theme",
            "type": "state",
            "common": {
                "name": "theme",
                "type": "string",
                "write": true,
                "read": true,
                "desc": "Change default theme during runtime",
                "states": {
                    "default": "default"
                }
            }
        },
        {
            "_id": "control.themeDark",
            "type": "state",
            "common": {
                "name": "theme",
                "type": "string",
                "write": true,
                "read": true,
                "desc": "Change default dark theme during runtime",
                "states": {
                    "default": "default"
                }
            }
        },
        {
            "_id": "notifications",
            "type": "channel",
            "common": {
                "name": "notifications"
            },
            "native": {}
        },
        {
            "_id": "notifications.list",
            "type": "state",
            "common": {
                "name": "alarm",
                "type": "json",
                "write": true,
                "read": true,
                "desc": "List of notifications"
            },
            "native": {}
        },
        {
            "_id": "notifications.add",
            "type": "state",
            "common": {
                "name": "Add notification",
                "type": "json",
                "write": true,
                "read": false,
                "desc": "Add notification"
            },
            "native": {}
        },
        {
            "_id": "notifications.clear",
            "type": "state",
            "common": {
                "name": "Clear notification",
                "type": "number",
                "write": true,
                "read": false,
                "desc": "Clear notification by id or all if no id"
            },
            "native": {}
        }
    ]
}
