{
  "common": {
    "name": "lovelace",
    "version": "2.1.4",
    "news": {
      "2.1.4": {
        "en": "Dependency update",
        "de": "Abhängigkeits-Update",
        "ru": "Обновление зависимости",
        "pt": "Atualização de dependência",
        "nl": "Afhankelijkheidsupdate",
        "fr": "Mise à jour des dépendances",
        "it": "Aggiornamento delle dipendenze",
        "es": "Actualización de dependencia",
        "pl": "Aktualizacja zależności",
        "zh-cn": "依赖更新"
      },
      "2.1.3": {
        "en": "Fixed: remove backup of old frontend (sorry)",
        "de": "Behoben: Backup des alten Frontends entfernen (sorry)",
        "ru": "Исправлено: удалить резервную копию старого интерфейса (извините)",
        "pt": "Corrigido: remover backup de front-end antigo (desculpe)",
        "nl": "Opgelost: verwijder back-up van oude frontend (sorry)",
        "fr": "Corrigé : supprimer la sauvegarde de l'ancienne interface (désolé)",
        "it": "Risolto: rimuovere il backup del vecchio frontend (scusate)",
        "es": "Corregido: eliminar la copia de seguridad de la interfaz anterior (lo siento)",
        "pl": "Naprawiono: usuń kopię zapasową starego frontendu (przepraszam)",
        "zh-cn": "修正：删除旧前端的备份（抱歉）"
      },
      "2.1.2": {
        "en": "Fixed: Menu was broken in frontend.",
        "de": "Behoben: Menü war im Frontend defekt.",
        "ru": "Исправлено: меню было сломано во внешнем интерфейсе.",
        "pt": "Corrigido: o menu estava quebrado no frontend.",
        "nl": "Opgelost: menu was gebroken in frontend.",
        "fr": "Corrigé : le menu était cassé dans le frontend.",
        "it": "Risolto: il menu era rotto nel frontend.",
        "es": "Corregido: el menú estaba roto en la interfaz.",
        "pl": "Naprawiono: Menu było zepsute we frontendzie.",
        "zh-cn": "修正：菜单在前端坏了。"
      },
      "2.1.1": {
        "en": "Fixed: Entity update in some cases.",
        "de": "Behoben: Entity-Update in einigen Fällen.",
        "ru": "Исправлено: обновление сущности в некоторых случаях.",
        "pt": "Fixo: atualização da entidade em alguns casos.",
        "nl": "Opgelost: Entiteitsupdate in sommige gevallen.",
        "fr": "Corrigé : mise à jour de l'entité dans certains cas.",
        "it": "Risolto: aggiornamento dell'entità in alcuni casi.",
        "es": "Corregido: actualización de la entidad en algunos casos.",
        "pl": "Naprawiono: Aktualizacja Entity w niektórych przypadkach.",
        "zh-cn": "修正：在某些情况下实体更新。"
      },
      "2.1.0": {
        "en": "* (Garfonso) Added: support for new things in frontend (like arm_vacation state, currency, ...).\n* (Garfonso) Change: Updated frontent to 20211229.0 (needs update of browser_mod, card_mod)",
        "de": "* (Garfonso) Hinzugefügt: Unterstützung für neue Dinge im Frontend (wie arm_vacation Zustand, Währung, ...).\n* (Garfonso) Änderung: Frontent auf 20211229.0 aktualisiert (benötigt möglicherweise Update von browser_mod, card_mod)",
        "ru": "* (Garfonso) Добавлено: поддержка новых вещей во внешнем интерфейсе (например, состояние arm_vacation, валюта, ...).\n* (Garfonso) Изменение: обновлен фронт до 20211229.0 (требуется обновление browser_mod, card_mod)",
        "pt": "* (Garfonso) Adicionado: suporte para coisas novas no frontend (como arm_vacation state, currency, ...).\n* (Garfonso) Alteração: frontent atualizado para 20211229.0 (precisa de atualização de browser_mod, card_mod)",
        "nl": "* (Garfonso) Toegevoegd: ondersteuning voor nieuwe dingen in frontend (zoals arm_vacation state, valuta, ...).\n* (Garfonso) Wijziging: frontent bijgewerkt naar 20211229.0 (update nodig van browser_mod, card_mod)",
        "fr": "* (Garfonso) Ajout : prise en charge de nouvelles choses en frontend (comme l'état arm_vacation, la devise, ...).\n* (Garfonso) Changement : frontent mis à jour vers 20211229.0 (nécessite une mise à jour de browser_mod, card_mod)",
        "it": "* (Garfonso) Aggiunto: supporto per nuove cose nel frontend (come arm_vacation state, currency, ...).\n* (Garfonso) Modifica: Frontent aggiornato a 20211229.0 (necessita di aggiornamento di browser_mod, card_mod)",
        "es": "* (Garfonso) Agregado: soporte para cosas nuevas en la interfaz (como estado arm_vacation, moneda, ...).\n* (Garfonso) Cambio: Interfaz actualizada a 20211229.0 (necesita actualización de browser_mod, card_mod)",
        "pl": "* (Garfonso) Dodano: wsparcie dla nowych rzeczy w interfejsie (takich jak stan arm_vacation, waluta, ...).\n* (Garfonso) Zmiana: Zaktualizowano frontent do 20211229.0 (wymaga aktualizacji browser_mod, card_mod)",
        "zh-cn": "* (Garfonso) 添加：支持前端的新事物（如 arm_vacation 状态、货币等）。\n* (Garfonso) 更改：将前端更新为 20211229.0（需要更新 browser_mod、card_mod）"
      },
      "2.0.7": {
        "en": "* (Garfonso) Fix: possible crash while creating light entity\n* (Garfonso) Fix: possible crashes in binding support\n* (Garfonso) Fix: /state/ handler for files (repairs for example Sonos cover image)\n* (Garfonso) Fix: tilt command was not correctly processed in ioBroker\n* (Garfonso) Fix: conversion issues in alarm control panel\n* (Garfonso) Fix: missed update if auto and manual entity were created from same ioBroker device\n* (Garfonso) Fixed: Warning on object change of manual entites\n* (Garfonso) Change: Subscribe ids for all config elements contain valid entity_ids (fixes tankerkoenig card and secondary-entity-row)\n* (Garfonso) Added: support for offline indicator (auto & manual) and online indicator\n* (Garfonso) Added: support for error, maintenance and working indicator (binary sensors)\n* (Garfonso) Added: more devices classes with custom settings\n* (Garfonso) Added: Support for calendar (only ical, use custom settings to create calendar entity on ical.*.data.table).",
        "de": "* (Garfonso) Fix: möglicher Absturz beim Erstellen von Lichtobjekten\n* (Garfonso) Fix: mögliche Abstürze bei binding support\n* (Garfonso) Fix: /state/ Handler für Dateien (repariert zB Sonos-Coverbild)\n* (Garfonso) Fix: Neigungsbefehl wurde in ioBroker nicht korrekt verarbeitet\n* (Garfonso) Fix: Konvertierungsprobleme in der Alarm-Karte\n* (Garfonso) Fix: verpasstes entity Update, wenn automatische und manuelle Entität vom selben ioBroker-Gerät erstellt wurden\n* (Garfonso) Behoben: Warnung bei Objektänderung von manuellen Entitäten\n* (Garfonso) Änderung: abonniere States für alle Konfigurationselemente, die gültige Entity_IDs enthalten (behebt nicht mehr aktuelle Tankerkoenig-Karte und Secondary-Entity-Zeile)\n* (Garfonso) Hinzugefügt: Unterstützung für Offline-Indiaktor (automatisch & manuell) und Online-Indikator\n* (Garfonso) Hinzugefügt: Unterstützung für Fehler-, Wartungs- und Arbeitsanzeige (binäre Sensoren)\n* (Garfonso) Hinzugefügt: mehr Geräteklassen mit benutzerdefinierten Einstellungen\n* (Garfonso) Hinzugefügt: Unterstützung für Kalender (nur ical, verwenden Sie benutzerdefinierte Einstellungen, um Kalenderentität auf ical.*.data.table zu erstellen).",
        "ru": "* (Garfonso) Исправление: возможный сбой при создании светового объекта\n* (Garfonso) Исправление: возможные сбои в поддержке привязки\n* (Garfonso) Исправление: / state / handler для файлов (восстановление например обложки Sonos)\n* (Garfonso) Исправление: команда наклона некорректно обрабатывалась в ioBroker\n* (Garfonso) Исправление: проблемы с преобразованием в панели управления сигнализацией.\n* (Garfonso) Исправление: пропущено обновление, если автоматическая и ручная сущность были созданы с одного и того же устройства ioBroker\n* (Garfonso) Исправлено: Предупреждение о смене объекта вручную.\n* (Garfonso) Изменение: идентификаторы подписки для всех элементов конфигурации содержат действительные идентификаторы entity_ids (исправлены карты tankerkoenig и строка второстепенного объекта)\n* (Garfonso) Добавлено: поддержка автономного индикатора (автоматический и ручной) и онлайн-индикатора.\n* (Garfonso) Добавлено: поддержка индикатора ошибок, обслуживания и работы (бинарные датчики)\n* (Garfonso) Добавлено: больше классов устройств с пользовательскими настройками\n* (Garfonso) Добавлено: Поддержка календаря (только ical, используйте пользовательские настройки для создания объекта календаря на ical. *. Data.table).",
        "pt": "* (Garfonso) Correção: possível travamento durante a criação de entidade leve\n* (Garfonso) Correção: possíveis falhas no suporte de ligação\n* (Garfonso) Correção: / state / handler para arquivos (reparos, por exemplo, imagem da capa do Sonos)\n* (Garfonso) Correção: o comando de inclinação não foi processado corretamente no ioBroker\n* (Garfonso) Correção: problemas de conversão no painel de controle de alarme\n* (Garfonso) Correção: atualização perdida se a entidade automática e manual foram criadas a partir do mesmo dispositivo ioBroker\n* (Garfonso) Corrigido: Aviso sobre mudança de objeto de entidades manuais\n* (Garfonso) Alteração: Os ids de inscrição para todos os elementos de configuração contêm entity_ids válidos (corrige o cartão tankerkoenig e a linha de entidade secundária)\n* (Garfonso) Adicionado: suporte para indicador offline (automático e manual) e indicador online\n* (Garfonso) Adicionado: suporte para indicador de erro, manutenção e funcionamento (sensores binários)\n* (Garfonso) Adicionado: mais classes de dispositivos com configurações personalizadas\n* (Garfonso) Adicionado: Suporte para calendário (apenas ical, use configurações personalizadas para criar entidade de calendário em ical. *. Data.table).",
        "nl": "* (Garfonso) Fix: mogelijke crash tijdens het maken van een lichte entiteit\n* (Garfonso) Fix: mogelijke crashes in bindingsondersteuning\n* (Garfonso) Fix: /state/ handler voor bestanden (reparaties bijvoorbeeld Sonos omslagafbeelding)\n* (Garfonso) Fix: kantelopdracht is niet correct verwerkt in ioBroker\n* (Garfonso) Oplossing: conversieproblemen in alarmcentrale\n* (Garfonso) Fix: gemiste update als automatische en handmatige entiteit zijn gemaakt vanaf hetzelfde ioBroker-apparaat\n* (Garfonso) Opgelost: waarschuwing bij objectwijziging van handmatige entiteiten\n* (Garfonso) Wijziging: Abonneer-ID's voor alle configuratie-elementen bevatten geldige entiteits-ID's (fixt tankerkoenig-kaart en secundaire entiteit-rij)\n* (Garfonso) Toegevoegd: ondersteuning voor offline indicator (auto & handmatig) en online indicator\n* (Garfonso) Toegevoegd: ondersteuning voor fout-, onderhouds- en werkindicator (binaire sensoren)\n* (Garfonso) Toegevoegd: meer apparaatklassen met aangepaste instellingen\n* (Garfonso) Toegevoegd: Ondersteuning voor kalender (alleen ical, gebruik aangepaste instellingen om kalenderentiteit te creëren op ical.*.data.table).",
        "fr": "* (Garfonso) Correction : crash possible lors de la création de l'entité lumineuse\n* (Garfonso) Correction : plantages possibles dans le support de liaison\n* (Garfonso) Correction : /state/ handler pour les fichiers (répare par exemple l'image de couverture de Sonos)\n* (Garfonso) Correction : la commande d'inclinaison n'était pas correctement traitée dans ioBroker\n* (Garfonso) Correction : problèmes de conversion dans le panneau de contrôle d'alarme\n* (Garfonso) Correction : mise à jour manquée si les entités automatique et manuelle ont été créées à partir du même appareil ioBroker\n* (Garfonso) Corrigé : Avertissement sur le changement d'objet des entités manuelles\n* (Garfonso) Changement : les identifiants d'abonnement pour tous les éléments de configuration contiennent des entity_ids valides (corrige la carte tankerkoenig et la ligne secondaire d'entité)\n* (Garfonso) Ajout : prise en charge de l'indicateur hors ligne (auto et manuel) et de l'indicateur en ligne\n* (Garfonso) Ajout : prise en charge des indicateurs d'erreur, de maintenance et de fonctionnement (capteurs binaires)\n* (Garfonso) Ajouté : plus de classes d'appareils avec des paramètres personnalisés\n* (Garfonso) Ajout : Prise en charge du calendrier (uniquement ical, utilisez des paramètres personnalisés pour créer une entité de calendrier sur ical.*.data.table).",
        "it": "* (Garfonso) Fix: possibile crash durante la creazione di entità luce\n* (Garfonso) Fix: possibili crash nel supporto del binding\n* (Garfonso) Fix: /state/ gestore per i file (ripara ad esempio l'immagine di copertina di Sonos)\n* (Garfonso) Fix: il comando tilt non è stato elaborato correttamente in ioBroker\n* (Garfonso) Fix: problemi di conversione nel pannello di controllo degli allarmi\n* (Garfonso) Fix: mancato aggiornamento se l'entità automatica e manuale sono state create dallo stesso dispositivo ioBroker\n* (Garfonso) Risolto: avviso sul cambio oggetto delle entità manuali\n* (Garfonso) Modifica: gli ID di sottoscrizione per tutti gli elementi di configurazione contengono entità_id validi (corregge la carta tankerkoenig e la riga di entità secondaria)\n* (Garfonso) Aggiunto: supporto per indicatore offline (automatico e manuale) e indicatore online\n* (Garfonso) Aggiunto: supporto per errore, manutenzione e indicatore di funzionamento (sensori binari)\n* (Garfonso) Aggiunto: più classi di dispositivi con impostazioni personalizzate\n* (Garfonso) Aggiunto: supporto per il calendario (solo ical, usa le impostazioni personalizzate per creare l'entità del calendario su ical.*.data.table).",
        "es": "* (Garfonso) Solución: posible bloqueo al crear una entidad de luz\n* (Garfonso) Solución: posibles bloqueos en el soporte de encuadernación\n* (Garfonso) Arreglo: / state / handler for files (reparaciones, por ejemplo, la imagen de portada de Sonos)\n* (Garfonso) Solución: el comando de inclinación no se procesó correctamente en ioBroker\n* (Garfonso) Solución: problemas de conversión en el panel de control de alarmas\n* (Garfonso) Solución: actualización perdida si la entidad automática y manual se crearon desde el mismo dispositivo ioBroker\n* (Garfonso) Corregido: Advertencia sobre el cambio de objeto de las entradas manuales\n* (Garfonso) Cambio: Los identificadores de suscripción para todos los elementos de configuración contienen entity_ids válidos (corrige la tarjeta de tankerkoenig y la fila de entidad secundaria)\n* (Garfonso) Agregado: soporte para indicador fuera de línea (automático y manual) e indicador en línea\n* (Garfonso) Agregado: soporte para indicador de error, mantenimiento y funcionamiento (sensores binarios)\n* (Garfonso) Agregado: más clases de dispositivos con configuraciones personalizadas\n* (Garfonso) Agregado: Soporte para calendario (solo ical, use configuraciones personalizadas para crear una entidad de calendario en ical. *. Data.table).",
        "pl": "* (Garfonso) Poprawka: możliwa awaria podczas tworzenia lekkiej jednostki\n* (Garfonso) Poprawka: możliwe awarie w obsłudze wiązania\n* (Garfonso) Poprawka: /state/ handler dla plików (naprawia np. okładkę Sonos)\n* (Garfonso) Poprawka: polecenie przechyłu nie zostało poprawnie przetworzone w ioBroker\n* (Garfonso) Poprawka: problemy z konwersją w panelu sterowania alarmami\n* (Garfonso) Poprawka: pominięta aktualizacja, jeśli encja automatyczna i ręczna została utworzona z tego samego urządzenia ioBroker\n* (Garfonso) Naprawiono: Ostrzeżenie o zmianie obiektu obiektów ręcznych\n* (Garfonso) Zmiana: Identyfikatory subskrypcji dla wszystkich elementów konfiguracyjnych zawierają prawidłowe entity_ids (naprawia kartę tankerkoenig i drugorzędny wiersz encji)\n* (Garfonso) Dodano: wsparcie dla wskaźnika offline (automatycznego i ręcznego) oraz wskaźnika online\n* (Garfonso) Dodano: wsparcie dla wskaźnika błędu, konserwacji i pracy (czujniki binarne)\n* (Garfonso) Dodano: więcej klas urządzeń z niestandardowymi ustawieniami\n* (Garfonso) Dodano: Wsparcie dla kalendarza (tylko ical, użyj ustawień niestandardowych, aby utworzyć encję kalendarza na ical.*.data.table).",
        "zh-cn": "* (Garfonso) 修复：创建光实体时可能崩溃\n* (Garfonso) 修复：绑定支持可能崩溃\n* (Garfonso) 修复：/state/ 文件处理程序（修复例如 Sonos 封面图片）\n* (Garfonso) 修复：倾斜命令在 ioBroker 中没有正确处理\n* (Garfonso) 修复：警报控制面板中的转换问题\n* (Garfonso) 修复：如果自动和手动实体是从同一个 ioBroker 设备创建的，则会错过更新\n* (Garfonso) 修正：手动实体的对象变化警告\n* (Garfonso) 更改：所有配置元素的订阅 ID 都包含有效的 entity_ids（修复 tankerkoenig 卡和辅助实体行）\n* (Garfonso) 添加：支持离线指示器（自动和手动）和在线指示器\n* (Garfonso) 添加：支持错误、维护和工作指示器（二进制传感器）\n* (Garfonso) 添加：更多带有自定义设置的设备类\n* (Garfonso) 添加：支持日历（仅 ical，使用自定义设置在 ical.*.data.table 上创建日历实体）。"
      },
      "2.0.6": {
        "en": "Add manual entity support for geo_location (inofficial currently)\nFix binding for other things than val (like ts or lc).\nAdd additional field for accuweather weather (and custom card)\ntranslate russian characters to allowed charset in ids\nAdd workaround for custom card upload issue with admin 5.\nfix history attribues with state and multiple attributes",
        "de": "Manuelle Entitätsunterstützung für geo_location hinzufügen (derzeit inoffiziell)\nFixe Bindung für andere Dinge als val (wie ts oder lc).\nZusätzliches Feld für Accuweather-Wetter (und benutzerdefinierte Karte) hinzufügen\nÜbersetzen Sie russische Zeichen in den zulässigen Zeichensatz in IDs\nProblemumgehung für Problem beim Hochladen von benutzerdefinierten Karten mit Administrator 5 hinzufügen.\nVerlaufsattribute mit Status und mehreren Attributen korrigieren",
        "ru": "Добавить ручную поддержку объекта для geo_location (в настоящее время неофициально)\nИсправьте привязку для других вещей, кроме val (например, ts или lc).\nДобавить дополнительное поле для погоды accuweather (и настраиваемую карту)\nперевести русские символы в разрешенную кодировку в идентификаторах\nДобавьте обходной путь для проблемы с загрузкой пользовательской карты с помощью администратора 5.\nисправить атрибуты истории с состоянием и несколькими атрибутами",
        "pt": "Adicionar suporte de entidade manual para geo_location (atualmente não oficial)\nCorrija a vinculação para outras coisas além de val (como ts ou lc).\nAdicionar campo adicional para o clima exato (e cartão personalizado)\ntraduzir caracteres russos para conjunto de caracteres permitido em ids\nAdicione uma solução alternativa para o problema de upload de cartão personalizado com o administrador 5.\ncorrigir atributos de histórico com estado e atributos múltiplos",
        "nl": "Voeg handmatige entiteitsondersteuning toe voor geo_location (momenteel niet-officieel)\nFix binding voor andere dingen dan val (zoals ts of lc).\nExtra veld toevoegen voor accuweerweer (en aangepaste kaart)\nvertaal Russische karakters naar toegestane karakterset in ids\nVoeg een tijdelijke oplossing toe voor een probleem met het uploaden van aangepaste kaarten met beheerder 5.\nrepareer geschiedenisattributen met staat en meerdere attributen",
        "fr": "Ajout de la prise en charge manuelle des entités pour la géo_location (inofficiel actuellement)\nCorrection de la liaison pour d'autres choses que val (comme ts ou lc).\nAjouter un champ supplémentaire pour la météo accuweather (et une carte personnalisée)\ntraduire les caractères russes en jeu de caractères autorisé dans les identifiants\nAjoutez une solution de contournement pour le problème de téléchargement de carte personnalisée avec admin 5.\ncorriger les attributs de l'historique avec l'état et plusieurs attributs",
        "it": "Aggiungi il supporto dell'entità manuale per geo_location (attualmente non ufficiale)\nCorreggi l'associazione per cose diverse da val (come ts o lc).\nAggiungi un campo aggiuntivo per accuweather meteo (e scheda personalizzata)\ntraduci i caratteri russi nel set di caratteri consentito negli ID\nAggiungi una soluzione alternativa per il problema di caricamento della carta personalizzata con l'amministratore 5.\ncorreggi gli attributi della cronologia con stato e attributi multipli",
        "es": "Agregar soporte de entidad manual para geo_location (no oficial actualmente)\nSe corrigió el enlace para otras cosas además de val (como ts o lc).\nAgregue un campo adicional para el clima accuweather (y tarjeta personalizada)\ntraducir caracteres rusos al juego de caracteres permitido en los identificadores\nAgregue una solución para el problema de carga de tarjetas personalizadas con el administrador 5.\narreglar atributos de historial con estado y atributos múltiples",
        "pl": "Dodaj ręczną obsługę encji dla geo_location (obecnie nieoficjalna)\nNapraw wiązanie dla innych rzeczy niż val (takich jak ts lub lc).\nDodaj dodatkowe pole na prognozę pogody Accuweather (i kartę niestandardową)\nprzetłumacz rosyjskie znaki na dozwolony zestaw znaków w identyfikatorach\nDodaj obejście problemu z przesyłaniem niestandardowej karty u administratora 5.\nnapraw atrybuty historii ze stanem i wieloma atrybutami",
        "zh-cn": "为 geo_location 添加手动实体支持（目前是非官方的）\n修复 val 以外的其他事物的绑定（如 ts 或 lc）。\n为 accuweather 天气（和自定义卡）添加附加字段\n将俄语字符转换为 ids 中允许的字符集\n使用 admin 5 添加自定义卡上传问题的解决方法。\n使用状态和多个属性修复历史属性"
      }
    },
    "title": "Visualization with Lovelace-UI",
    "titleLang": {
      "en": "Visualization with Lovelace-UI",
      "de": "Visualisierung mit Lovelace-UI",
      "ru": "Визуализация с помощью Lovelace-UI",
      "pt": "Visualização com Lovelace-UI",
      "nl": "Visualisatie met Lovelace-UI",
      "fr": "Visualisation avec Lovelace-UI",
      "it": "Visualizzazione con Lovelace-UI",
      "es": "Visualización con Lovelace-UI",
      "pl": "Wizualizacja za pomocą Lovelace-UI",
      "zh-cn": "使用Lovelace-UI进行可视化"
    },
    "desc": {
      "en": "With this adapter you can build visualization for ioBroker with Home Assistant Lovelace UI",
      "de": "Mit diesem Adapter können Sie eine Visualisierung für ioBroker mit der Home Assistant Lovelace-Benutzeroberfläche erstellen",
      "ru": "С помощью этого адаптера вы можете создавать визуализацию для ioBroker с Home Assistant Lovelace UI",
      "pt": "Com este adaptador você pode construir visualização para o ioBroker com o Home Assistant Lovelace UI",
      "nl": "Met deze adapter kunt u visualisatie bouwen voor ioBroker met Home Assistant Lovelace UI",
      "fr": "Avec cet adaptateur, vous pouvez créer une visualisation pour ioBroker avec Home Assistant Lovelace UI",
      "it": "Con questo adattatore puoi costruire la visualizzazione per ioBroker con l'interfaccia utente di Home Assistant Lovelace",
      "es": "Con este adaptador puede crear visualización para ioBroker con Home Assistant Lovelace UI",
      "pl": "Za pomocą tego adaptera możesz zbudować wizualizację dla ioBroker z interfejsem Home Assistant Lovelace",
      "zh-cn": "使用此适配器，您可以使用Home Assistant Lovelace UI为ioBroker构建可视化"
    },
    "authors": [
      "bluefox <dogafox@gmail.com>"
    ],
    "keywords": [
      "ioBroker",
      "template",
      "Smart Home",
      "home automation"
    ],
    "license": "Apache-2.0",
    "platform": "Javascript/Node.js",
    "tier": 3,
    "icon": "lovelace.png",
    "main": "main.js",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.lovelace/master/admin/lovelace.png",
    "readme": "https://github.com/ioBroker/ioBroker.lovelace/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "visualization",
    "compact": true,
    "materialize": true,
    "supportCustoms": true,
    "messagebox": true,
    "connectionType": "local",
    "dataSource": "push",
    "localLink": "%protocol%://%ip%:%port%/",
    "welcomeScreen1": {
      "link": "",
      "name": "Lovelace",
      "img": "lovelace/icons/favicon-192x192.png",
      "color": "#03a9f4",
      "order": 2,
      "localLink": true
    },
    "dependencies": [
      {
        "js-controller": ">=3.3.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=3.0.0"
      }
    ],
    "welcomeScreenPro": {
      "link": "lovelace/",
      "name": "Lovelace",
      "img": "lovelace.admin/lovelace.png",
      "color": "#03a9f4",
      "order": 6,
      "localLink": true
    }
  },
  "native": {
    "history": "",
    "historyMaxCount": 2000,
    "port": 8091,
    "auth": false,
    "secure": false,
    "bind": "0.0.0.0",
    "certPublic": "",
    "certPrivate": "",
    "certChained": "",
    "defaultUser": "admin",
    "onlyAllowWhenUserIsOwner": false,
    "ttl": 3600,
    "themes": "",
    "defaultTheme": "default",
    "defaultThemeDark": "default",
    "hideHeader": false,
    "leEnabled": false,
    "leUpdate": false,
    "leCheckPort": 80,
    "aliayOnly": false,
    "blindsInvert": false,
    "alarmCheckCodeOnDisarmOnly": false
  },
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.entitiesUpdated",
      "type": "state",
      "common": {
        "name": "If the list of entities was updated",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "state",
        "def": false
      }
    },
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": "user files and images for lovelace",
        "type": "meta.user"
      },
      "native": {}
    },
    {
      "_id": "configuration",
      "type": "channel",
      "common": {
        "name": "Storage"
      },
      "native": {}
    },
    {
      "_id": "session",
      "type": "state",
      "common": {
        "name": "Oauth2 Session",
        "type": "json",
        "role": "state"
      },
      "native": {}
    },
    {
      "_id": "conversation",
      "type": "state",
      "common": {
        "name": "Question and answer for conversation ",
        "desc": "Question and answer for conversation dialog. See readme for how to use.",
        "desc1": {
          "en": "Question and answer for conversation dialog. See readme for how to use.",
          "de": "Frage und Antwort zum Gesprächsdialog. Informationen zur Verwendung finden Sie in der Readme-Datei.",
          "ru": "Вопрос и ответ для диалога. Смотрите readme для того, чтобы использовать.",
          "pt": "Perguntas e respostas para o diálogo de conversação. Consulte o leia-me para saber como usar.",
          "nl": "Vraag en antwoord voor gespreksdialoog. Zie leesmij voor gebruik.",
          "fr": "Question et réponse pour le dialogue de conversation. Voir le readme pour savoir comment l'utiliser.",
          "it": "Domanda e risposta per la finestra di dialogo di conversazione. Vedi il file Leggimi per come usare.",
          "es": "Preguntas y respuestas para el diálogo de conversación. Consulte el archivo Léame para saber cómo usarlo.",
          "pl": "Pytania i odpowiedzi do dialogu rozmowy. Zobacz, jak używać.",
          "zh-cn": "对话对话框的问答。有关使用方法，请参见自述文件。"
        },
        "type": "string",
        "role": "state"
      },
      "native": {}
    },
    {
      "_id": "control",
      "type": "channel",
      "common": {
        "name": "Control lovelace"
      },
      "native": {}
    },
    {
      "_id": "control.shopping_list",
      "type": "state",
      "common": {
        "name": "Shopping list as json",
        "type": "json",
        "write": true,
        "read": true,
        "desc": "Used for shopping list card"
      },
      "native": {}
    },
    {
      "_id": "control.alarm",
      "type": "state",
      "common": {
        "name": "alarm",
        "type": "boolean",
        "write": true,
        "read": true,
        "desc": "Arm or disarm with code",
        "def": false
      },
      "native": {
        "alarm_code": 1234
      }
    },
    {
      "_id": "control.alarm_arm_state",
      "type": "state",
      "common": {
        "name": "arm status",
        "type": "number",
        "write": true,
        "read": true,
        "desc": "Alarm arm status",
        "def": 0,
        "states": {
          "0": "disarmed",
          "1": "armed",
          "2": "armed_home",
          "3": "armed_away",
          "4": "armed_night",
          "5": "armed_custom_bypass",
          "6": "pending",
          "7": "arming",
          "8": "disarming",
          "9": "triggered",
          "10": "arm_vacation"
        }
      },
      "native": {
        "alarm_code": 1234
      }
    },
    {
      "_id": "control.theme",
      "type": "state",
      "common": {
        "name": "theme",
        "type": "string",
        "write": true,
        "read": true,
        "desc": "Change default theme during runtime",
        "states": {
          "default": "default"
        }
      }
    },
    {
      "_id": "control.themeDark",
      "type": "state",
      "common": {
        "name": "theme",
        "type": "string",
        "write": true,
        "read": true,
        "desc": "Change default dark theme during runtime",
        "states": {
          "default": "default"
        }
      }
    },
    {
      "_id": "control.darkMode",
      "type": "state",
      "common": {
        "name": "Dark Mode",
        "desc": "Allows to switch to dark/light mode without changing themes (some themes support both)",
        "write": true,
        "read": true,
        "def": false
      }
    },
    {
      "_id": "notifications",
      "type": "channel",
      "common": {
        "name": "notifications"
      },
      "native": {}
    },
    {
      "_id": "notifications.list",
      "type": "state",
      "common": {
        "name": "alarm",
        "type": "json",
        "write": true,
        "read": true,
        "desc": "List of notifications"
      },
      "native": {}
    },
    {
      "_id": "notifications.add",
      "type": "state",
      "common": {
        "name": "Add notification",
        "type": "string",
        "write": true,
        "read": false,
        "desc": "Add notification"
      },
      "native": {}
    },
    {
      "_id": "notifications.clear",
      "type": "state",
      "common": {
        "name": "Clear notification",
        "type": "number",
        "write": true,
        "read": false,
        "desc": "Clear notification by id or all if no id"
      },
      "native": {}
    }
  ]
}
