{
  "common": {
    "name": "lovelace",
    "version": "5.0.3",
    "news": {
      "5.0.3": {
        "en": "make sure only existing themes are selectable in control.theme states.\nbring back support for frontend_es5.",
        "de": "sicher stellen, dass nur vorhandene themen in der steuerung über states wählbar sind.\nunterstützung für frontend_es5 wiederhergestellt.",
        "ru": "убедитесь, что только существующие темы поддаются выбору. темы государств.\nподдержка интерфейса frontend_es5.",
        "pt": "certifique-se de que apenas os temas existentes são selecionáveis no controle. estados temáticos.\ntrazer suporte para frontend_es5.",
        "nl": "zorg ervoor dat alleen bestaande thema's zijn geselecteerd in controle. thema staat.\nondersteuning voor frontend_es5 terugbrengen.",
        "fr": "assurez-vous que seuls les thèmes existants peuvent être sélectionnés dans le contrôle. les états thématiques.\nramener le support de frontend_es5.",
        "it": "assicurarsi che solo i temi esistenti siano selezionabili in controllo. stati tematici.\nriportare il supporto per frontend_es5.",
        "es": "asegúrese de que sólo los temas existentes son seleccionables en control. estados temáticos.\ntraer apoyo para frontend_es5.",
        "pl": "upewnij się, że tylko istniejące motywy są wybierane pod kontrolą. stan tematyczny.\nprzywrócić wsparcie dla frontend _ es5.",
        "uk": "переконайтеся, що тільки існуючі теми вибираються в управлінні. тематичні стани.\nповернути підтримку фронтенд_es5.",
        "zh-cn": "确保控制中只选择现有主题。 主题状态.\n带回对前端_es5的支持."
      },
      "5.0.2": {
        "en": "some light entities did not restore their proper state on switch on. Fixed.\nprocess folders-Objects for auto entities, too. (pirate-weather support)\nprepare support for effects in light entities (will need new type-detector version).",
        "de": "einige Licht entities haben ihren Zustand beim Einschalten nicht wiederhergestellt. Behoben.\nOrdner-Objekte auch für Auto-Entitäten bearbeiten. (Pirate-Wetter-Unterstützung)\ndie unterstützung von effekten in Licht entities vorbereitet (benötigt neue typ-detektor-version).",
        "ru": "некоторые легкие сущности не восстановили свое надлежащее состояние при включении. Исправлено.\nтакже обрабатывают папки-объекты для автообъектов. (поддержка пиратской погоды)\nподготовить поддержку эффектов в легких объектах (требуется новая версия детектора типа).",
        "pt": "algumas entidades de luz não restauraram seu estado adequado no interruptor ligado. Consertado.\npastas de processo-Objects para entidades auto, também. (suporte de pirate-weather)\npreparar suporte para efeitos em entidades leves (necessitará de uma nova versão do detector de tipo).",
        "nl": "sommige lichte entiteiten hebben hun juiste staat bij het inschakelen niet hersteld. Vast.\nproces mappen-objecten voor auto-entiteiten, ook. (Pirate-weather support)\nvoorbereiding van ondersteuning voor effecten in lichte entiteiten (zal nieuwe type-detector versie nodig hebben).",
        "fr": "certaines entités lumineuses n'ont pas rétabli leur état d'activation. Corrigé.\ntraiter les dossiers-Objects pour les entités auto, aussi. (soutien en temps de pluie)\npréparer le support des effets dans les entités lumineuses (il faudra une nouvelle version de détecteur de type).",
        "it": "alcune entità leggere non hanno ripristinato il loro stato corretto all'accensione. Risolto.\nprocess folders-Objects per entità auto, troppo. (Supporto pirata-matrimoniale)\npreparare il supporto per gli effetti in entità leggere (sarà necessario una nuova versione di tipo-detector).",
        "es": "algunas entidades de luz no restauraron su estado adecuado encendido encendido encendido. Arreglado.\ncarpetas de proceso-Objetos para entidades de automóviles, también. (Apoyo de piratería-tetera)\npreparar soporte para efectos en entidades ligeras (necesitará nueva versión tipo-detector).",
        "pl": "niektóre jednostki świetlne nie przywróciły swojego stanu włączania. Naprawione.\nfoldery procesu- Obiekty dla podmiotów samochodowych, też. (wsparcie pirackiej pogody)\nprzygotować wsparcie dla efektów w jednostkach świetlnych (potrzeba nowej wersji czujnika typu).",
        "uk": "деякі світлові особи не відновили належний стан на перемикачі. Фіксований.\nобробляє папки-об'єкти для автооб'єктів. (приватно-пожежна підтримка)\nпідготувати підтримку ефектів у легких суб’єктах (необхідно потрібна нова версія-детектора).",
        "zh-cn": "一些轻实体没有在开关时恢复正常状态。 固定着.\n用于自动实体的处理文件夹-对象。 (发作天气支持)\n为光实体中的效果准备支持(需要新的类型检测器版本)."
      },
      "5.0.1": {
        "en": "* (Garfonso) settings from entity registry are now loaded on startup\n* (Garfonso) logbook: prevent entries from the future\n* (Garfonso) icons should now work as before, again.\n* (Garfonso) script entities now can be used again.\n* (Garfonso) subscribe to all object ids in a template.\n* (Garfonso) Update dependencies.",
        "de": "* (Garfonso) Einstellungen aus der Entitätsregistrierung werden nun beim Start geladen\n* (Garfonso) Logbuch: Einträge aus der Zukunft verhindern\n* (Garfonso) Icons sollten nun wieder wie zuvor funktionieren.\n* (Garfonso) Skriptentitäten können nun wieder verwendet werden.\n* (Garfonso) alle Objekt-IDs in einer Vorlage abonnieren.\n* (Garfonso) Aktualisieren von Abhängigkeiten.",
        "ru": "* (Garfonso) настройки из реестра сущностей теперь загружаются при запуске\n* (Гарфонсо) журнал: предотвратить записи из будущего\n* (Garfonso) Иконки теперь должны работать как прежде.\n* (Garfonso) сущности скриптов теперь могут быть использованы снова.\n* (Garfonso) подписаться на все идентификаторы объектов в шаблоне.\n* (Garfonso) Обновление зависимостей.",
        "pt": "* (Garfonso) as definições do registo de entidades são agora carregadas no arranque\n* (Garfonso) diário de bordo: evitar entradas do futuro\n* (Garfonso) Os ícones devem agora voltar a funcionar como antes.\n* (Garfonso) as entidades de script podem agora ser utilizadas novamente.\n* (Garfonso) subscrever todos os ids de objectos num modelo.\n* (Garfonso) Atualizar dependências.",
        "nl": "* (Garfonso) instellingen uit het entiteitsregister worden nu geladen bij het opstarten\n* (Garfonso) logboek: voorkom toevoegingen uit de toekomst\n* (Garfonso) pictogrammen zouden nu weer als vanouds moeten werken.\n* (Garfonso) scriptentiteiten kunnen nu weer gebruikt worden.\n* (Garfonso) abonneer je op alle object-ids in een sjabloon.\n* (Garfonso) Afhankelijkheden bijwerken.",
        "fr": "* (Garfonso) les paramètres du registre des entités sont désormais chargés au démarrage\n* (Garfonso) journal de bord : prévenir les entrées du futur\n* (Garfonso) Les icônes devraient maintenant fonctionner comme avant.\n* (Garfonso) les entités de script peuvent maintenant être utilisées à nouveau.\n* (Garfonso) s'abonner à tous les identifiants d'objets dans un modèle.\n* (Garfonso) Mise à jour des dépendances.",
        "it": "* Le impostazioni del registro delle entità vengono ora caricate all'avvio.\n* Diario di bordo (Garfonso): impedire le voci dal futuro\n* (Garfonso) Le icone dovrebbero ora funzionare di nuovo come prima.\n* (Garfonso) Le entità di script ora possono essere usate di nuovo.\n* (Garfonso) sottoscrivere tutti gli id degli oggetti in un modello.\n* (Garfonso) Aggiornamento delle dipendenze.",
        "es": "* (Garfonso) los ajustes del registro de entidades se cargan ahora al iniciarse.\n* (Garfonso) cuaderno de bitácora: evitar entradas del futuro\n* (Garfonso) los iconos ahora deberían funcionar como antes, de nuevo.\n* (Garfonso) las entidades de script ahora se pueden usar de nuevo.\n* (Garfonso) suscribirse a todos los ids de objetos de una plantilla.\n* (Garfonso) Actualizar dependencias.",
        "pl": "* (Garfonso) ustawienia z rejestru jednostek są teraz ładowane podczas uruchamiania.\n* (Garfonso) dziennik: zapobieganie wpisom z przyszłości\n* (Garfonso) Ikony powinny teraz działać jak poprzednio.\n* (Garfonso) encje skryptów mogą być teraz ponownie używane.\n* (Garfonso) subskrybowanie wszystkich identyfikatorów obiektów w szablonie.\n* (Garfonso) Aktualizacja zależności.",
        "uk": "* (Garfonso) налаштування з реєстру сутностей тепер завантажуються під час запуску\n* Журнал (Garfonso): запобігання записам у майбутньому\n* (Гарфонсо) іконки тепер повинні знову працювати, як раніше.\n* (Garfonso) скриптові об'єкти тепер можна використовувати знову.\n* (Гарфонсо) підписатися на всі ідентифікатори об'єктів у шаблоні.\n* (Гарфонсо) Оновити залежності.",
        "zh-cn": "* (Garfonso) settings from entity registry are now loaded on startup\n* (Garfonso) logbook: prevent entries from the future\n* (Garfonso) icons should now work as before, again.\n* (Garfonso) script entities now can be used again.\n* (Garfonso) subscribe to all object ids in a template.\n* (Garfonso) Update dependencies."
      },
      "5.0.0": {
        "en": "BREAKING: Updated frontend to 20250401.0\nUpdated browser_mod to 2.3.3\nAdd statistics recorder\nAdd entity registry, use it to solve id clashes. In the future, store entity settings here.\nLimit the number of stored browser instances\nImproved caching behavior. Might solve iobroker.pro issue... hopefully?\nPrevent crash with some edge cases with light entities\nexperimental dashboard support.\nAllow to show sidebar via object in instances. VERY experimental. A lot of stuff does not yet work. But allows to configure dashboards and also browser mod.",
        "de": "BREAKING: Aktualisiertes Frontend auf 20250401.0\nAktualisierter Browser_mod auf 2.3.3\nStatistik Recorder implementiert\nEntity-Registry implement, wird verwendet um id clashes zu lösen. In der Zukunft speicher der Adapter hier Entity-Einstellungen.\nDie Anzahl der gespeicherten Browser-Instanzen beschränkt\nVerbessertes Cacheverhalten. Könnte Probleme mit iobroker.pro lösen... hoffentlich?\nVerhindert Crash mit einigen Randfällen mit Lichteinheiten\nexperimentelle dashboard-unterstützung.\nSidebar über Objekt anzeigbar machen. Sehr experimentell. Vieles funktioniert noch nicht. Aber erlaubt dashboards und auch Browser-Mod zu konfigurieren.",
        "ru": "BREAKING: Обновленный интерфейс до 20250401.0\nОбновленный браузер_mod до 2.3.3\nДобавить запись статистики\nДобавьте реестр юридических лиц, используйте его для решения конфликтов идентификаторов. В будущем, настройки объекта хранения здесь.\nОграничьте количество сохраненных экземпляров браузера\nУлучшение кэширования поведения. Может решить проблему с йоброкером. Профессиональный вопрос... надеюсь?\nПредотвращение аварий с некоторыми крайними случаями со светлыми объектами\nэкспериментальная поддержка приборной панели.\nПозволяет показывать боковую панель через объект в примерах. Очень экспериментально. Многое еще не работает. Но позволяет настраивать панели инструментов, а также мод браузера.",
        "pt": "BREAKING: Frontend atualizado para 20250401.0\nAtualizado browser_mod para 2.3.3\nAdicionar gravador de estatísticas\nAdicionar registro de entidade, usá-lo para resolver conflitos de identificação. No futuro, armazenar configurações de entidade aqui.\nLimite o número de instâncias do navegador armazenados\nMelhor comportamento de caching. Pode resolver o iobroker. pro problema... espero?\nImpedir acidente com alguns casos de borda com entidades leves\nsuporte de painel experimental.\nPermitir mostrar barra lateral via objeto em instâncias. Muito experimental. Muitas coisas ainda não funcionam. Mas permite configurar painéis e também o mod do navegador.",
        "nl": "BREAKING: Bijgewerkt frontend naar 20250401.0\nBijgewerkte browser_mod naar 2.3.3\nStatistiekenrecorder toevoegen\nVoeg entiteit register toe, gebruik het om id botsingen op te lossen. In de toekomst, opslag entiteit instellingen hier.\nHet aantal opgeslagen browser-instances beperken\nBeter cachinggedrag. Misschien lost Iobroker op. Pro kwestie... hopelijk?\nVoorkom crash met sommige rand gevallen met lichte entiteiten\nexperimentele dashboard ondersteuning.\nZijbalk tonen via object in instanties. Erg experimenteel. Veel dingen werken nog niet. Maar maakt het mogelijk om dashboards te configureren en ook browser mod.",
        "fr": "BREAKING: Frontend mis à jour vers 20250401.0\nMise à jour du navigateur_mod à 2.3.3\nAjouter un enregistreur de statistiques\nAjouter le registre des entités, l'utiliser pour résoudre les affrontements id. Dans l'avenir, stocker les paramètres de l'entité ici.\nLimiter le nombre d'instances du navigateur stockées\nAmélioration du comportement de cache. Ça pourrait résoudre iobroker. Numéro pro... espérons ?\nPrévenir l'écrasement avec certains cas bord avec des entités lumineuses\nsupport expérimental du tableau de bord.\nPermet d'afficher la barre latérale via objet dans les instances. Très expérimental. Beaucoup de choses ne fonctionnent pas encore. Mais permet de configurer les tableaux de bord et aussi le navigateur mod.",
        "it": "BREAKING: Aggiornato frontend a 20250401.0\nAggiornato browser_mod a 2.3.3\nAggiungi record di statistiche\nAggiungere il registro delle entità, usarlo per risolvere gli scontri id. In futuro, memorizzare le impostazioni dell'entità qui.\nLimitare il numero di istanze del browser memorizzate\nComportamento di caching migliorato. Potrebbe risolvere lo iobroker. problema pro... speriamo?\nPrevenire crash con alcuni casi di bordo con entità leggere\nsupporto cruscotto sperimentale.\nConsentire di mostrare la barra laterale tramite oggetto in istanze. Molto sperimentale. Molte cose non funzionano ancora. Ma permette di configurare dashboard e anche mod browser.",
        "es": "BREAKING: Inicio actualizado a 20250401.0\nActualizado navegador_mod a 2.3.3\nAgregar registro de estadísticas\nAñadir registro de entidad, utilizarlo para resolver choques id. En el futuro, almacena la configuración de entidad aquí.\nLimite el número de instancias del navegador almacenadas\nMejor comportamiento de caché. Podría resolver el iobroker. ¿Pro issue... espero?\nEvitar el choque con algunos casos de borde con entidades ligeras\nsoporte de panel experimental.\nPermite mostrar la barra lateral a través del objeto en los casos. Muy experimental. Muchas cosas todavía no funcionan. Pero permite configurar los paneles y también el mod del navegador.",
        "pl": "BREAKING: Aktualizacja frontu do 20250401.0\nAktualizacja przeglądarki _ mod do 2.3.3\nDodaj rejestrator statystyk\nDodaj rejestr jednostek, użyj go do rozwiązywania starć ID. W przyszłości, przechowywać ustawienia podmiotów tutaj.\nOgranicz liczbę zapisanych instancji przeglądarki\nUlepszone zachowanie. Może rozwiąże sprawę iobrokera. pro issue... miejmy nadzieję?\nZapobieganie awarii z niektórych skrzyń krawędzi z lekkimi jednostkami\neksperymentalne wsparcie desek rozdzielczych.\nPozwala wyświetlać pasek boczny przez obiekt w instancjach. Bardzo eksperymentalne. Wiele rzeczy jeszcze nie działa. Ale pozwala na konfigurację desek rozdzielczych, a także mod przeglądarki.",
        "uk": "BREAKING: Оновлений фронтенд до 20250401.0\nОновлено браузер_mod до 2.3.3\nДодати рекордер статистики\nДодайте реєстр суб’єкта господарювання, використовуйте його для вирішення id-зітків. У майбутньому тут зберігати налаштування суб’єкта господарювання.\nОбмеження кількості збережених екземплярів браузера\nПокращена поведінка кешування. Мигий розчин iobroker. Про проблему... надії?\nЗапобігти збитку з деякими крайовими випадками зі світловими особами\nекспериментальна підтримка панелі приладів.\nДозволити показати бічну панель через об'єкт в екземплярах. ДУЖЕ експериментальний. Багато речей ще не працюють. Але дозволяє налаштовувати панельи і також моду браузера.",
        "zh-cn": "BREAKING: 更新前端为20250401.0\n更新浏览器_mod 到 2.3.3\n添加统计记录器\n添加实体注册, 用于解决 id 冲突 。 未来,在此存储实体设置 .\n限制存储浏览器实例数\n改进了潜伏行为 可能解决io经纪人。 有希望吗?\n防止轻实体发生一些边缘事故\n实验仪表板支持.\n允许通过对象显示边栏。 非常实验 很多东西还没用 但允许配置仪表板和浏览器mod."
      },
      "4.1.15": {
        "en": "repaired image loading, again.",
        "de": "Bilder laden nochmal verändert. Jetzt geht hoffentlich alles.",
        "ru": "восстановлена загрузка изображения, опять же.",
        "pt": "carga de imagem reparada, novamente.",
        "nl": "hersteld beeld laden, opnieuw.",
        "fr": "réparation de chargement d'image, encore.",
        "it": "caricamento immagine riparato, di nuovo.",
        "es": "reparado carga de imagen, otra vez.",
        "pl": "ponownie naprawiono ładowanie obrazu.",
        "uk": "ремонтувати завантаження зображень, знову.",
        "zh-cn": "再次修复图像加载 ."
      },
      "4.1.14": {
        "en": "repaired image loading. Fixes #577",
        "de": "Bilder laden repariert. Fixes #577",
        "ru": "восстановленная загрузка изображения. Исправления #577",
        "pt": "carga de imagem reparada. Correções #577",
        "nl": "hersteld beeld laden. Fixes #577",
        "fr": "chargement d'image réparé. Corrige #577",
        "it": "caricamento dell'immagine riparato. Correzioni #577",
        "es": "carga de imagen reparada. Arreglos #577",
        "pl": "naprawiono ładowanie obrazu. Fixes # 577",
        "uk": "відремонтовано завантаження зображень. Виправлення #577",
        "zh-cn": "修复图像加载。 修复 #577"
      },
      "4.1.13": {
        "en": "reworked image sending. Now weather icons work for normal users, too. Also weather images are transfered from our server, so no access to admin is needed anymore.",
        "de": "reworked image send. Jetzt funktionieren auch Wettersymbole für normale Benutzer. Auch Wetterbilder werden von unserem Server übertragen, so dass kein Zugriff auf Admin mehr erforderlich ist.",
        "ru": "переделанная отправка изображений. Теперь иконки погоды работают и для обычных пользователей. Также с нашего сервера передаются погодные изображения, поэтому доступ к администратору больше не требуется.",
        "pt": "envio de imagem retrabalhado. Agora os ícones do tempo funcionam para usuários normais, também. Também as imagens meteorológicas são transferidas do nosso servidor, então não é necessário mais acesso a admin.",
        "nl": "herwerkte afbeelding verzenden. Nu weer pictogrammen werken voor normale gebruikers, ook. Ook weerbeelden worden overgebracht van onze server, zodat geen toegang meer nodig is tot admin.",
        "fr": "l'envoi d'images retravaillées. Maintenant, les icônes météo fonctionnent aussi pour les utilisateurs normaux. Aussi les images météorologiques sont transférées de notre serveur, de sorte qu'aucun accès à admin n'est plus nécessaire.",
        "it": "l'invio di immagini rielaborate. Ora le icone meteo funzionano anche per gli utenti normali. Anche le immagini meteo vengono trasferite dal nostro server, quindi non è più necessario accedere all'amministratore.",
        "es": "reelaboró el envío de imagen. Ahora los iconos meteorológicos también funcionan para los usuarios normales. También las imágenes del tiempo son transferidas desde nuestro servidor, por lo que ya no se necesita acceso a admin.",
        "pl": "przerabiane wysyłanie obrazów. Teraz ikony pogodowe działają również dla zwykłych użytkowników. Również obrazy pogody są transfered z naszego serwera, więc nie jest już potrzebny dostęp do admin.",
        "uk": "переробляти посилку зображення. Ікони погоди працюють для нормальних користувачів. Крім того, погодні зображення передаються з нашого сервера, тому не потрібно доступу до адміну.",
        "zh-cn": "重新工作图像发送 。 现在天气图标也为正常用户服务. 还有天气图像是从我们的服务器传输的,所以不再需要访问管理员了."
      }
    },
    "titleLang": {
      "en": "Visualization with Lovelace-UI",
      "de": "Visualisierung mit Lovelace-UI",
      "ru": "Визуализация с помощью Lovelace-UI",
      "pt": "Visualização com Lovelace-UI",
      "nl": "Visualisatie met Lovelace-UI",
      "fr": "Visualisation avec Lovelace-UI",
      "it": "Visualizzazione con Lovelace-UI",
      "es": "Visualización con Lovelace-UI",
      "pl": "Wizualizacja za pomocą Lovelace-UI",
      "zh-cn": "使用Lovelace-UI进行可视化",
      "uk": "Візуалізація за допомогою Lovelace-UI"
    },
    "desc": {
      "en": "With this adapter you can build visualization for ioBroker with Home Assistant Lovelace UI",
      "de": "Mit diesem Adapter können Sie eine Visualisierung für ioBroker mit der Home Assistant Lovelace-Benutzeroberfläche erstellen",
      "ru": "С помощью этого адаптера вы можете создавать визуализацию для ioBroker с Home Assistant Lovelace UI",
      "pt": "Com este adaptador você pode construir visualização para o ioBroker com o Home Assistant Lovelace UI",
      "nl": "Met deze adapter kunt u visualisatie bouwen voor ioBroker met Home Assistant Lovelace UI",
      "fr": "Avec cet adaptateur, vous pouvez créer une visualisation pour ioBroker avec Home Assistant Lovelace UI",
      "it": "Con questo adattatore puoi costruire la visualizzazione per ioBroker con l'interfaccia utente di Home Assistant Lovelace",
      "es": "Con este adaptador puede crear visualización para ioBroker con Home Assistant Lovelace UI",
      "pl": "Za pomocą tego adaptera możesz zbudować wizualizację dla ioBroker z interfejsem Home Assistant Lovelace",
      "zh-cn": "使用此适配器，您可以使用Home Assistant Lovelace UI为ioBroker构建可视化",
      "uk": "За допомогою цього адаптера ви можете створити візуалізацію для ioBroker з інтерфейсом користувача Home Assistant Lovelace"
    },
    "authors": [
      "bluefox <dogafox@gmail.com>"
    ],
    "keywords": [
      "visualisation",
      "lovelace",
      "easy",
      "What you see is what you get",
      "home automation"
    ],
    "licenseInformation": {
      "license": "Apache-2.0",
      "link": "https://github.com/ioBroker/ioBroker.lovelace/blob/master/LICENSE",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "tier": 3,
    "icon": "lovelace.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.lovelace/master/admin/lovelace.png",
    "readme": "https://github.com/ioBroker/ioBroker.lovelace/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "visualization",
    "compact": true,
    "adminUI": {
      "config": "materialize"
    },
    "supportCustoms": true,
    "messagebox": true,
    "connectionType": "local",
    "dataSource": "push",
    "localLinks": {
      "_default": {
        "link": "%protocol%://%ip%:%port%/",
        "name": "Lovelace",
        "color": "#14C8FF",
        "pro": "lovelace/",
        "intro": true
      }
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<=2.0.0",
            "newVersion>=3.0.0"
          ]
        },
        "title": {
          "en": "Visualisation Update",
          "de": "Aktualisierung der Visualisierung",
          "ru": "Обновление визуализации",
          "pt": "Atualização da visualização",
          "nl": "Visualisatie Update",
          "fr": "Mise à jour de la visualisation",
          "it": "Aggiornamento della visualizzazione",
          "es": "Actualización de Visualización",
          "pl": "Visualizacja",
          "uk": "Оновлення візуалізації",
          "zh-cn": "更新"
        },
        "text": {
          "en": "The update to version 3.x will change frontend version from 20211229.0 to 20221026.0. This means 10 months development of Lovelace in one update. You will probably need to update or fix your themes and custom cards. Please make sure to check your visualization after this update. Ask in forum or discord for help.",
          "de": "Das Update auf Version 3.x wird die Frontend Version von 20211229.0 auf 20221026.0 ändern. Dies bedeutet 10 Monate Entwicklung von Lovelace in einem Update. Sie müssen wahrscheinlich Ihre Themen und benutzerdefinierten Karten aktualisieren oder reparieren. Achten Sie darauf, Ihre Visualisierung nach diesem Update zu überprüfen. Fragen Sie im Forum oder Discord nach Hilfe.",
          "ru": "Обновление до версии 3.x изменит версию frontend от 20211229.0 до 20221026.0 Это означает 10 месяцев разработки Lovelace в одном обновлении. Вам, вероятно, нужно обновить или исправить ваши темы и пользовательские карты. Пожалуйста, проверьте вашу визуализацию после этого обновления. Спросите на форуме или несогласно помощи.",
          "pt": "A atualização para a versão 3.x mudará a versão do frontend de 20211229.0 para 20221026.0 Isso significa desenvolvimento de 10 meses do Lovelace em uma atualização. Você provavelmente precisará atualizar ou corrigir seus temas e cartões personalizados. Certifique-se de verificar sua visualização após esta atualização. Pergunte no fórum ou Discord para ajuda.",
          "nl": "De update van versie 3.x zal de frontend versie veranderen van 20211229.0 tot 202226. Dit betekent 10 maanden ontwikkeling van Lovelace in één update. Je moet waarschijnlijk updaten of je thema's en kaarten repareren. Controleer uw visualisatie na deze update. Vraag in forum of Discord om hulp.",
          "fr": "La mise à jour de la version 3.x va changer la version frontend de 20211229.0 à 20221026.0 Cela signifie 10 mois de développement de Lovelace dans une mise à jour. Vous devrez probablement mettre à jour ou corriger vos thèmes et vos cartes personnalisées. Assurez-vous de vérifier votre visualisation après cette mise à jour. Demandez de l'aide au forum ou à la Discord.",
          "it": "L'aggiornamento alla versione 3.x cambierà la versione frontend da 20211229.0 a 20221026.0 Ciò significa 10 mesi di sviluppo di Lovelace in un unico aggiornamento. Probabilmente dovrai aggiornare o correggere i tuoi temi e le tue carte personalizzate. Assicurati di controllare la visualizzazione dopo questo aggiornamento. Chiedi aiuto in forum o Discord.",
          "es": "La actualización a la versión 3.x cambiará la versión de frontend de 20211229.0 a 20221026.0 Esto significa desarrollo de 10 meses de Lovelace en una actualización. Probablemente necesite actualizar o arreglar sus temas y tarjetas personalizadas. Asegúrese de comprobar su visualización después de esta actualización. Pida ayuda en el foro o Discord.",
          "pl": "Zaktualizowana wersja 3.x będzie zmieniała przednią wersję od 20211229.0 do 20221026.0. Oznacza to, że w jednym uaktualnianiu jest 10 miesięcy rozwój Lovelace. Prawdopodobnie potrzebuje uaktualnienia lub naprawienia swoich motywów i kart. Postanawia sprawdzić wizualizację po tej aktualizacji. Odpowiada za pomoc.",
          "uk": "Оновлення версії 3.x змінить версію фронтенду з 20211229.0 до 20221026.0 Це означає 10 місяців розробки Lovelace в одному оновленні. Ви, ймовірно, повинні оновити або виправити ваші теми і спеціальні картки. Будь ласка, перевірте вашу візуалізацію після цього оновлення. Запитайте на форум або розпишіться на допомогу.",
          "zh-cn": "更新后的3.x将改变20211229.0至20221026年的前沿版本。 这就意味着在更新的一年里发展了良机。 你很可能需要更新或确定你们的主题和习俗卡。 请确保在更新之后检查你的视觉。 论坛或有帮助的办事处。."
        },
        "link": "https://forum.iobroker.net/topic/34775/test-adapter-lovelace-v1-2-x/1324?_=1666881699892",
        "level": "warn",
        "linkText": {
          "en": "A few issues with themes were already discussed here.",
          "de": "Hier wurden bereits einige Themen diskutiert.",
          "ru": "Здесь уже обсуждались несколько вопросов с темами.",
          "pt": "Algumas questões com temas já foram discutidas aqui.",
          "nl": "Een paar problemen met ze werden hier al besproken.",
          "fr": "Quelques questions avec des thèmes ont déjà été discutées ici.",
          "it": "Sono già state discusse alcune questioni con temi.",
          "es": "Algunos temas con temas ya se discutieron aquí.",
          "pl": "Omawiano tam kilka tematów.",
          "uk": "Тут вже обговорювалися кілька питань з темами.",
          "zh-cn": "这里已经讨论了几个专题的问题。."
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      },
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<=3.0.0",
            "newVersion>=4.0.0"
          ]
        },
        "title": {
          "en": "Visualisation Update",
          "de": "Aktualisierung der Visualisierung",
          "ru": "Обновление визуализации",
          "pt": "Atualização da visualização",
          "nl": "Visualisatie Update",
          "fr": "Mise à jour de la visualisation",
          "it": "Aggiornamento della visualizzazione",
          "es": "Actualización de Visualización",
          "pl": "Visualizacja",
          "uk": "Оновлення візуалізації",
          "zh-cn": "更新"
        },
        "text": {
          "en": "The update to version 4.x will change the frontend version from 20221026.0 to 20231208.2. This implies many months of Lovelace development in a single update. You will likely need to update or fix your themes and custom cards. Make sure to review your visualization after this update. Seek help in the forum or Discord if needed.",
          "de": "Das Update auf Version 4.x wird die Frontend Version von 20221026.0 auf 20231208.2 ändern. Dies bedeutet 10 Monate Entwicklung von Lovelace in einem Update. Sie müssen wahrscheinlich Ihre Themen und benutzerdefinierten Karten aktualisieren oder reparieren. Achten Sie darauf, Ihre Visualisierung nach diesem Update zu überprüfen. Fragen Sie im Forum oder Discord nach Hilfe.",
          "ru": "Обновление до версии 4.x изменит версию интерфейса с 20221026.0 на 20231208.2. Это означает многомесячную разработку Lovelace в рамках одного обновления. Вам, вероятно, придется обновить или исправить свои темы и пользовательские карты. Обязательно проверьте свою визуализацию после этого обновления. Задавайте вопросы на форуме или в Discord, если вам нужна помощь.",
          "pt": "A atualização para a versão 4.x irá alterar a versão do frontend de 20221026.0 para 20231208.2. Isso significa muitos meses de desenvolvimento do Lovelace em uma única atualização. Você provavelmente precisará atualizar ou corrigir seus temas e cartões personalizados. Certifique-se de verificar sua visualização após esta atualização. Procure ajuda no fórum ou no Discord, se necessário.",
          "nl": "De update naar versie 4.x zal de frontend-versie veranderen van 20221026.0 naar 20231208.2. Dit betekent vele maanden ontwikkeling van Lovelace in één update. Waarschijnlijk moet u uw thema's en aangepaste kaarten bijwerken of herstellen. Controleer na deze update uw visualisatie. Vraag om hulp op het forum of Discord indien nodig.",
          "fr": "La mise à jour vers la version 4.x changera la version du frontend de 20221026.0 à 20231208.2. Cela signifie plusieurs mois de développement de Lovelace en une seule mise à jour. Vous devrez probablement mettre à jour ou réparer vos thèmes et cartes personnalisées. Assurez-vous de vérifier votre visualisation après cette mise à jour. Demandez de l'aide sur le forum ou sur Discord si nécessaire.",
          "it": "L'aggiornamento alla versione 4.x cambierà la versione del frontend da 20221026.0 a 20231208.2. Ciò significa molti mesi di sviluppo di Lovelace in un singolo aggiornamento. Probabilmente sarà necessario aggiornare o correggere i temi e le carte personalizzate. Assicurati di controllare la tua visualizzazione dopo questo aggiornamento. Chiedi aiuto sul forum o su Discord se necessario.",
          "es": "La actualización a la versión 4.x cambiará la versión del frontend de 20221026.0 a 20231208.2. Esto significa muchos meses de desarrollo de Lovelace en una sola actualización. Probablemente necesitarás actualizar o corregir tus temas y tarjetas personalizadas. Asegúrate de revisar tu visualización después de esta actualización. Busca ayuda en el foro o en Discord si es necesario.",
          "pl": "Aktualizacja do wersji 4.x zmieni wersję frontendu z 20221026.0 na 20231208.2. Oznacza to wiele miesięcy rozwoju Lovelace w jednej aktualizacji. Prawdopodobnie będziesz musiał zaktualizować lub naprawić swoje motywy i niestandardowe karty. Upewnij się, że sprawdzisz swoją wizualizację po tej aktualizacji. Szukaj pomocy na forum lub Discord, jeśli to konieczne.",
          "uk": "Оновлення до версії 4.x змінить версію фронтенду з 20221026.0 на 20231208.2. Це означає багато місяців розробки Lovelace у одному оновленні. Ймовірно, вам доведеться оновити або виправити свої теми та власні картки. Переконайтеся, що після цього оновлення ви переглянете свою візуалізацію. Звертайтеся за допомогою на форумі або в Discord, якщо потрібно.",
          "zh-cn": "升级到4.x版本将把前端版本从20221026.0更改为20231208.2。这意味着在一个更新中进行了数月的Lovelace开发。您可能需要更新或修复您的主题和自定义卡片。请确保在此更新后检查您的可视化。如有需要，请在论坛或Discord上寻求帮助。"
        },
        "link": "https://forum.iobroker.net/topic/59435/test-lovelace-4-x/408?_=1705695186248",
        "level": "warn",
        "linkText": {
          "en": "A few issues with themes were already discussed here.",
          "de": "Hier wurden bereits einige Themen diskutiert.",
          "ru": "Здесь уже обсуждались несколько вопросов с темами.",
          "pt": "Algumas questões com temas já foram discutidas aqui.",
          "nl": "Een paar problemen met ze werden hier al besproken.",
          "fr": "Quelques questions avec des thèmes ont déjà été discutées ici.",
          "it": "Sono già state discusse alcune questioni con temi.",
          "es": "Algunos temas con temas ya se discutieron aquí.",
          "pl": "Omawiano tam kilka tematów.",
          "uk": "Тут вже обговорювалися кілька питань з темами.",
          "zh-cn": "这里已经讨论了几个专题的问题。."
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ],
    "dependencies": [
      {
        "js-controller": ">=6.0.11"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=7.6.17"
      }
    ]
  },
  "native": {
    "history": "",
    "historyMaxCount": 2000,
    "port": 8091,
    "auth": false,
    "secure": false,
    "bind": "0.0.0.0",
    "certPublic": "",
    "certPrivate": "",
    "certChained": "",
    "defaultUser": "admin",
    "onlyAllowWhenUserIsOwner": false,
    "ttl": 3600,
    "showUsersOnLoginScreen": false,
    "themes": "",
    "defaultTheme": "default",
    "defaultThemeDark": "default",
    "leEnabled": false,
    "leUpdate": false,
    "leCheckPort": 80,
    "aliasOnly": false,
    "blindsInvert": false,
    "alarmCheckCodeOnDisarmOnly": false,
    "language": "",
    "updateTimeout": 5000,
    "logbookSource": "adapter",
    "maxBrowserInstances": 10
  },
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.entitiesUpdated",
      "type": "state",
      "common": {
        "name": "If the list of entities was updated",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "indicator",
        "def": false
      }
    },
    {
      "_id": "info.configUpdateProcessed",
      "type": "state",
      "common": {
        "name": "If a config update was processed",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "indicator",
        "def": false
      }
    },
    {
      "_id": "info.readyForClients",
      "type": "state",
      "common": {
        "name": "Lovelace is ready to interact with UI and ioBroker.",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "indicator.reachable",
        "def": false
      }
    },
    {
      "_id": "",
      "type": "meta",
      "common": {
        "name": "user files and images for lovelace",
        "type": "meta.user"
      },
      "native": {}
    },
    {
      "_id": "configuration",
      "type": "channel",
      "common": {
        "name": "Storage"
      },
      "native": {}
    },
    {
      "_id": "entityRegistry",
      "type": "channel",
      "common": {
        "name": "Storage for entity registry"
      },
      "native": {}
    },
    {
      "_id": "dashboardStorage",
      "type": "channel",
      "common": {
        "name": "Storage for dashboards"
      },
      "native": {}
    },
    {
      "_id": "session",
      "type": "state",
      "common": {
        "name": "Oauth2 Session",
        "type": "json",
        "role": "state"
      },
      "native": {}
    },
    {
      "_id": "conversation",
      "type": "state",
      "common": {
        "name": "Question and answer for conversation ",
        "desc": "Question and answer for conversation dialog. See readme for how to use.",
        "desc1": {
          "en": "Question and answer for conversation dialog. See readme for how to use.",
          "de": "Frage und Antwort zum Gesprächsdialog. Informationen zur Verwendung finden Sie in der Readme-Datei.",
          "ru": "Вопрос и ответ для диалога. Смотрите readme для того, чтобы использовать.",
          "pt": "Perguntas e respostas para o diálogo de conversação. Consulte o leia-me para saber como usar.",
          "nl": "Vraag en antwoord voor gespreksdialoog. Zie leesmij voor gebruik.",
          "fr": "Question et réponse pour le dialogue de conversation. Voir le readme pour savoir comment l'utiliser.",
          "it": "Domanda e risposta per la finestra di dialogo di conversazione. Vedi il file Leggimi per come usare.",
          "es": "Preguntas y respuestas para el diálogo de conversación. Consulte el archivo Léame para saber cómo usarlo.",
          "pl": "Pytania i odpowiedzi do dialogu rozmowy. Zobacz, jak używać.",
          "zh-cn": "对话对话框的问答。有关使用方法，请参见自述文件。"
        },
        "type": "string",
        "role": "text"
      },
      "native": {}
    },
    {
      "_id": "control",
      "type": "channel",
      "common": {
        "name": "Control lovelace"
      },
      "native": {}
    },
    {
      "_id": "control.shopping_list",
      "type": "state",
      "common": {
        "name": "Shopping list as json",
        "type": "json",
        "write": true,
        "read": true,
        "role": "json",
        "desc": "Used for shopping list card"
      },
      "native": {}
    },
    {
      "_id": "control.alarm",
      "type": "state",
      "common": {
        "name": "alarm",
        "type": "boolean",
        "write": true,
        "read": true,
        "role": "switch.enable",
        "desc": "Arm or disarm with code",
        "def": false
      },
      "native": {
        "alarm_code": 1234
      }
    },
    {
      "_id": "control.alarm_arm_state",
      "type": "state",
      "common": {
        "name": "arm status",
        "type": "number",
        "write": true,
        "read": true,
        "role": "text",
        "desc": "Set/Read alarm arm status",
        "def": 0,
        "states": {
          "0": "disarmed",
          "1": "armed",
          "2": "armed_home",
          "3": "armed_away",
          "4": "armed_night",
          "5": "armed_custom_bypass",
          "6": "pending",
          "7": "arming",
          "8": "disarming",
          "9": "triggered",
          "10": "arm_vacation"
        }
      },
      "native": {
        "alarm_code": 1234
      }
    },
    {
      "_id": "control.theme",
      "type": "state",
      "common": {
        "name": "theme",
        "type": "string",
        "write": true,
        "read": true,
        "role": "text",
        "desc": "Change default theme during runtime",
        "states": {
          "default": "default"
        }
      }
    },
    {
      "_id": "control.themeDark",
      "type": "state",
      "common": {
        "name": "theme",
        "type": "string",
        "write": true,
        "read": true,
        "role": "text",
        "desc": "Change default dark theme during runtime",
        "states": {
          "default": "default"
        }
      }
    },
    {
      "_id": "control.darkMode",
      "type": "state",
      "common": {
        "name": "Dark Mode",
        "desc": "Allows to switch to dark/light mode without changing themes (some themes support both)",
        "write": true,
        "read": true,
        "role": "switch.mode.dark",
        "def": false
      }
    },
    {
      "_id": "notifications",
      "type": "channel",
      "common": {
        "name": "notifications"
      },
      "native": {}
    },
    {
      "_id": "notifications.list",
      "type": "state",
      "common": {
        "name": "alarm",
        "type": "json",
        "role": "text",
        "write": true,
        "read": true,
        "desc": "List of notifications"
      },
      "native": {}
    },
    {
      "_id": "notifications.add",
      "type": "state",
      "common": {
        "name": "Add notification",
        "type": "string",
        "role": "text",
        "write": true,
        "read": false,
        "desc": "Add notification"
      },
      "native": {}
    },
    {
      "_id": "notifications.clear",
      "type": "state",
      "common": {
        "name": "Clear notification",
        "type": "number",
        "role": "state",
        "write": true,
        "read": false,
        "desc": "Clear notification by id or all if no id"
      },
      "native": {}
    }
  ]
}
